[
  {
    "university": "The University of Auckland",
    "country": "New Zealand",
    "title": "“Sancore” at Sanford. Digital\ntransformation through\nMicrosoft D365 Finance &\nOperations",
    "content": "Louise Wood, the Chief Supply Chain Officer at Sanford\nLimited, provides insights into the Manufacturing\nExecution Systems Innova in seafood processing sites,\ndeep sea vessels, and enterprise-wide digital\ntransformation to businesses. From Albert Sanford starting his own Auckland fishing business in 1864, to 225\naquaculture farms, 43 vessels, 16 sites nationwide and about 1400 people today,\nSanford is New Zealand’s oldest and largest fishing company. But don’t let the\ncompany’s age fool you. Sanford puts modern technology, innovation and\nsustainability first to make sure their position as seafood industry leaders will\nremain for at least another 150 years.\nJune saw Sanford go Live with the biggest system change they have seen as a\nbusiness. The scope of the change has been to implement Manufacturing\nExecution Systems (MES) Innova into 4 seafood processing sites and 12 Deep Sea\nvessels and enterprise-wide Microsoft D365 F & O to the NZ and Australian\nbusinesses including multiple inventory holding locations and several toll\nmanufacturing sites.\nThe project was originally scoped in 2019 and had to contend with design\nrequirements and early build and integrations being completed during the Covid\n“lockdown” periods. From a Supply Chain perspective, the project was complex\ngiven the range of vertically integrated value chains that exist in the business and\nthe need to ensure a high bar in traceability due to regulatory requirements across\nthe seafood sector. There was also a requirement to improve the visibility of\nproducts in transit and integrate with customers and logistics services suppliers.\nAccurate product costing, given the nature of primary production and disaggregation of seafood and the cost to serve, were also requirements. D365 was\nseen as a platform on which the business could grow into the future and add\nadditional functionality once the core was embedded. Other areas to be further\nexplored include Integrated Business Planning (IBP) and Asset Management.\nSome of the key learnings to come from the project have been the need for strong\nprogram infrastructure (ways of working, project management tools, resources) as\nwell as strong governance and project management leadership. Having Executive\nsponsorship and Board support is key to alignment on project objectives and\npriorities once the scope is confirmed, as there will always be choices to be made\nonce the project starts and assumptions around resource and cost are tested. It\nwas important for Sanford to complete a capability and capacity review of its\nresources and where different and additional skill sets were identified, they were\nbrought into the project. The project has delivered growth in people’s capabilities\nas they have had to find new ways of working across a fully integrated system and\nbuild more technical knowledge.\nThe D365 go-live has been a huge change initiative for Sanford, which has\nimpacted almost everyone throughout the organisation in some way over the last\ncouple of years. The build-up to go live in terms of planning and data migration\nwas significant. All of Sanford’s inventory, its purchasing and manufacturing\nintegrations across its processing and storage sites went live simultaneously. This\nwas also made more complex by a complete overhaul of all its product master\ndata. The data mapping work involved in over 3500 SKUs across over 800\ninventory locations across 3rd Party Logistics, 3rd Party Manufacturing, Vessels\nand Sanford sites was in itself an epic piece of work. Understanding the\nimportance of master data had been growing steadily over the project timeline\nand with several Master data champions across the business, the focus in this area\nhad been a worthwhile investment.\nIntegrations with MES and with other external partners were found to be more\nresource intensive and challenging than originally assumed. Having designs for\nboth ERP and MES in a state of flux at the same time presented some unique\nchallenges for our integration teams in terms of pinning down filed mappings and\nbuilding firm functional and technical design documents. There was no blueprint\nfor our ERP to MES integration with the teams needing to iterate and make\npractical choices on the way through. The level of collaboration required across our business, program and partner teams was significant, and a high degree of\nrework was experienced as we learned more and revisited / optimized our design.\nOverall, the integration team delivered all the “temporary integrations” MES to\nlegacy ERP and over 30 long term integration points supporting MES to D365 and\nD365 to 3rd parties.\nIn collaboration with Sealord and MPI, Sanford built an industry tool to manage\nand trade or Allowable Catch Entitlement (ACE), effectively quota with the\nintention that this product is made available commercially to NZ fishing industry in\nthe future. We undertook a significant in-house application build to automate our\npayroll calculations to Crew and to contract fishers with our new CrewPay solution\nnow live and supporting regular payments.\nThe perseverance and work ethic across many has been a testament to Sanford’s\nculture and only through its people was the project able to come to a successful\ngo live. There is certainly more work to do to stabilise and optimise business\nprocesses and data so our business stakeholders must see the current and future\nbenefits they have sought through this project. We now have the start of a journey\ninto the future to showcase and deliver our beautiful New Zealand seafood to both\nlocal and international customers."
  },
  {
    "university": "The University of Auckland",
    "country": "New Zealand",
    "title": "Business Transformation\nOffice's impressive paper\nsaving",
    "content": "A reduction in paper and energy consumption, time\nsavings, cost cuts and an improved customer experience\nare some of the benefits resulting from two process\nimprovements introduced by the Business\nTransformation Office. The Business Process Enablement (BPE) programme has developed forms to meet\nthe majority of digital form needs for the University, with staff encouraged to use\nthe digital version rather than the former paper records.\nWorking across the University, the BPE programme has uncovered a total 700\nforms of which 140 were designated as no longer required and 400 have been\ndigitised.With an estimated 110,000 form submissions annually, the paper\nmountain soon builds up. Based on an average of two pages per paper form and\nassuming each paper form is printed out only twice, this equates to a staggering\n440,000 pieces of paper each year.\nThe environmental cost of this is significant – 190,321 litres of water, 1,930\nkilograms of waste and 7,425 kilograms of wood. These figures do not include the\ncost of packing and transporting paper nor storing paper or disposing of waste\npaper. This amount of paper equates to a 17 story building and costs $4,000, with\nthe additional cost to the University of $74,200 for the maintenance of printers.\nElspet Garvey, manager of the Business Transformation Office, says the digitisation\nof many forms, along with an earlier ‘good idea’ to set double-sided printing as a\ndefault, has made inroads into a paper-based culture.\n The Business Transformation Office initiative, nominated in the Environmental\nSustainability category of the Vice Chancellor’s Excellence Awards, was described\nby the judges as an “excellent initiative which was self-started in response to a\nstrategic plan target and effectively executed with widespread engagement”. The\njudges noted it provided University-wide value with a focus on training and\ncapacity building."
  },
  {
    "university": "The University of Auckland",
    "country": "New Zealand",
    "title": "What Smart Companies Know\nAbout Integrating AI",
    "content": "Research-based recommendations for companies to\ncapitalize on their investments in the digital\ntransformation of sales, spanning various industries.\n Article originally appeared in Harvard Business Review, July\u0002August 2023\nBy Silvio Palumbo andDavid Edelman.\nWhat/Focus\nCompanies are investing heavily in digital transformation, including of sales,\nhowever many are struggling to capitalise on their efforts. There is little research\nevidence and guidance on how to holistically transform sales, leading to the\nimplementation of random and incremental processes. The aim of this article is to\nprovide a prescriptive model based on a literature review and semi-structured\ninterviews with managers and salespeople across a range of industries. The model\nis then applied to analyse the current state of digital transformation of sales\nprocesses in an international sample of companies (N = 540) and highlight the\ndistinctive features of the most successful companies with practical examples and\nactionable guidelines.\nHow (Details/Methods)\nThe literature review identifies two limitations of existing studies. First is the\npredominant focus on selected phenomena such as the adoption of customer\u0002relationship management (CRM) technology, resulting in partial models that only cover one aspect of transformation. Second, most studies have looked at\ndigitalisation in terms of marketing strategies, with relatively few considering its\nrelevance for sales processes. Sales processes can be broken down into three\n(preselling, selling, after-sales) phases and their subprocesses across people and\ndepartments. To sum up, salespeople need to manage multiple and complex\nactivities in their interactions not only with customers, but also inside their own\norganisations.\nTo conceptualize a model for the digitalisation of sales, a qualitative study was\nconducted with managers and salespeople across different industries to\ndetermine the status quo of how digital technologies impact selling processes in\npractice.\nRather than incorporating the three selling phases, the resulting model\ndistinguishes between the transformation/digitalisation of customer interaction\nprocesses and internal processes, and their accompanying information processes.\nMoreover, an in-depth analysis of the examples collected yielded six underlying\nthemes of how technology alleviates the lack of knowledge, speed, reach, and\nperceived value identified by interviewees. These 6 S pathways of digital\ntransformation in sales are substitute, supplement, service, simplify, support, and\nshare. For example, if the main goal of the digital transformation is to increase\nefficiency in internal processes by addressing a lack of speed, then companies may\ninvest in digital technologies that help simplify processes, mainly through\nautomation.\nThe next stage of the study was a cross-national quantitative survey study\nspanning the United States, the United Kingdom, Germany, and Italy. The aim was\nto gauge how managerial practice performed against the prescriptive framework\nfor managing the digital transformation of sales.\nFour categories of company were subsequently identified with regard to digital\nsales: transformation leaders, transformation laggards, sales enablers, and sales\nreplacers. The article concludes with three sets of guidelines for the managers of\nsuch companies, whatever category they fall into.\nSo What First, managers can use the prescriptive framework to steer their digital\ntransformation endeavours. Companies should start by carefully mapping their\nsales processes, juxtaposing the importance of each process against its current\nperformance. They can then focus further analyses on those processes that are\nhighly important yet underperforming. For these processes, managers should\nidentify critical pains that digitalisation can help resolve and choose digital\npathways accordingly. They can then implement key actions along with\nperformance indicators.\nSecond, managers can identify where they sit in relation to the four categories to\ncapitalise on strengths and remedy weaknesses.\nLast, while these recommendations will facilitate a structured approach, managers\nshould be aware that their digital transformation endeavours are unlikely to be a\nsure-fire success and change will take time."
  },
  {
    "university": "The University of Auckland",
    "country": "New Zealand",
    "title": "Focus on digital transformation and sustainability",
    "content": "Experts from China, Singapore, USA, and New Zealand\ncame together recently to discuss and debate the\ntransformative power of digital technology at an online\nresearch symposium hosted by the Centre for Digital\nEnterprise (CODE). CODE is a new interdisciplinary research unit at the University of Auckland\nresearching topics including digital platforms, digital sourcing, and artificial\nintelligence, to name just a few.\nKicking the symposium off was Steve James from Countdown NZ who spoke about\nthe explosive growth in their online market during the Covid-19 lockdown. The\ncompany has seen a mass acceleration in the digital space with over 200,000\nshoppers registering for online shopping in one night.\nHis advice, “Before you start on a digital transformation – which is a term thrown\naround lightly by organisations - and invest in digital technology, you really need\nto understand your business strategy, and customer value proposition.”\n“Digital technology is merely a tool to support what you want to achieve as a\nbusiness, and so it’s vital you know what that is. Do you really know what your\ncustomers want?”\nSteve says digital transformation was always going to happen, but the pandemic\nhas accelerated its implementation.\nUS speaker Josh Buckley defined digital transformation as ‘the adoption of digital\ntechnology to transform services or businesses, replacing non-digital or manual processes with digital processes, or replacing older technology with newer\ntechnology, in order to amplify and enable human potential.’\nHailing from the construction industry, Josh emphasised the focus must be on\neffectiveness and efficiency. “Ask yourself why and how am I doing this?“\nHe emphasized that introducing new technology for its own sake is meaningless.\n“Instead introduce a new idea or a new effective workflow, and then find the\ntechnology that will enable that.”\nBranding and marketing expert Derek Sun from Oppo, defined digital\ntransformation as ‘applying technology to create significant competitive\nadvantages.’\n“If there are no significant competitive advantages created then I don’t think it can\nbe called transformative. It’s incremental progression rather than transformation.”\n“Leveraging digital platforms can create new business models like Uber or Airbnb.\nUltimately its about the value that technology brings to companies. This requires\ncontinuous learning. Be curious about everything.”\nThe second session focused on digital sustainability led by the President of TCS\nAsia-Pacific, Girish Ramachandran and KPMG NZ CIO, Cowan Pettigrew. In this\nsession, speakers expressed concern about the lack of commitment to\nsustainability objectives and outlined their vision for harnessing the power of\ndigital to improve sustainability."
  },
  {
    "university": "The University of Auckland",
    "country": "New Zealand",
    "title": "Digital transformation: airport\necosystem forward planning\nwith actionable insights\n",
    "content": "On 9 June 2021, the Centre of Digital Enterprise and the Centre for Supply Chain\nManagement jointly presented a webinar on digital transformation.\nIn this webinar, Christopher Ting, capacity optimisation manager at Auckland\nAirport, shared his insights and experience on how the capacity optimisation team\nused advance digital technologies to help organisations operating at Auckland\nAirport to maintain excellent guest experience, and to provide a safe environment\nfor staff and guests.\nMore than any other industries, COVID-19 has had a rapid and catastrophic impact\non global travel and tourism. Despite reductions in airlines, routes and travelling\nguests, Auckland Airport has continued to focus on digital transformation.\nCommunicating with internal teams and external agencies, they provided\nseamless guest journeys at the international and domestic terminals in the COVID-\n19 landscape.\nThe Operations division has used digital transformation to more efficiently provide\nreliable planning information for the airport community and to assist with\ndemand-led staffing resource allocations. They drove the adoption of advanced\nanalytics and modelling to help with the airport’s short-term and long-term\ncapacity management and coordinated inter-agencies forward planning activities."
  },
  {
    "university": "The University of Auckland",
    "country": "New Zealand",
    "title": "Mastering the digital\ntransformation of sales",
    "content": "Research-based recommendations for implementing\neffective digital transformation, looking at successful\ncompanies around the globe.\n Article originally appeared in California Management Review,\n2020, Vol. 62(4) Pg. 57-85\nBy Paolo Guenzi and Johannes Habel\nWhat/Focus\nCompanies are investing heavily in digital transformation, including of sales,\nhowever many are struggling to capitalise on their efforts. There is little research\nevidence and guidance on how to holistically transform sales, leading to the\nimplementation of random and incremental processes. The aim of this article is to\nprovide a prescriptive model based on a literature review and semi-structured\ninterviews with managers and salespeople across a range of industries. The model\nis then applied to analyse the current state of digital transformation of sales\nprocesses in an international sample of companies (N = 540) and highlight the\ndistinctive features of the most successful companies with practical examples and\nactionable guidelines.\nHow (Details/Methods)\nThe literature review identifies two limitations of existing studies. First is the\npredominant focus on selected phenomena such as the adoption of customer\u0002relationship management (CRM) technology, resulting in partial models that only\ncover one aspect of transformation. Second, most studies have looked at\ndigitalisation in terms of marketing strategies, with relatively few considering its\n relevance for sales processes. Sales processes can be broken down into three\n(preselling, selling, after-sales) phases and their subprocesses across people and\ndepartments. To sum up, salespeople need to manage multiple and complex\nactivities in their interactions not only with customers, but also inside their own\norganisations.\nTo conceptualize a model for the digitalisation of sales, a qualitative study was\nconducted with managers and salespeople across different industries to\ndetermine the status quo of how digital technologies impact selling processes in\npractice.\nRather than incorporating the three selling phases, the resulting model\ndistinguishes between the transformation/digitalisation of customer interaction\nprocesses and internal processes, and their accompanying information processes.\nMoreover, an in-depth analysis of the examples collected yielded six underlying\nthemes of how technology alleviates the lack of knowledge, speed, reach, and\nperceived value identified by interviewees. These 6 S pathways of digital\ntransformation in sales are substitute, supplement, service, simplify, support, and\nshare. For example, if the main goal of the digital transformation is to increase\nefficiency in internal processes by addressing a lack of speed, then companies may\ninvest in digital technologies that help simplify processes, mainly through\nautomation.\nThe next stage of the study was a cross-national quantitative survey study\nspanning the United States, the United Kingdom, Germany, and Italy. The aim was\nto gauge how managerial practice performed against the prescriptive framework\nfor managing the digital transformation of sales.\nFour categories of company were subsequently identified with regard to digital\nsales: transformation leaders, transformation laggards, sales enablers, and sales\nreplacers. The article concludes with three sets of guidelines for the managers of\nsuch companies, whatever category they fall into.\nSo What\nFirst, managers can use the prescriptive framework to steer their digital\ntransformation endeavours. Companies should start by carefully mapping their\nsales processes, juxtaposing the importance of each process against its current\n performance. They can then focus further analyses on those processes that are\nhighly important yet underperforming. For these processes, managers should\nidentify critical pains that digitalisation can help resolve and choose digital\npathways accordingly. They can then implement key actions along with\nperformance indicators.\nSecond, managers can identify where they sit in relation to the four categories to\ncapitalise on strengths and remedy weaknesses.\nLast, while these recommendations will facilitate a structured approach, managers\nshould be aware that their digital transformation endeavours are unlikely to be a\nsure-fire success and change will take time.\n"
  }
]

