[
  {
    "university": "Chulalongkorn university",
    "country": "Thailand",
    "title": "Chula Employs the “Speedboat Strategy”\nto Drive Innovations for Society",
    "content": "To celebrate its 105th anniversary, Chula President announces\nthe success of the “Speedboat Strategy” in managing the\nuniversity in a volatile situation to drive social innovations,\nfocusing on being a research university that teaches, revising\nits curriculum, and building graduates’ competencies in line\nwith the world of the future. During the past few and rather difficult years most of us have faced with the COVID-19\npandemic, Chulalongkorn University has launched several innovations and studies to\nserve the society, such as CU-RoboCovid – a medical support robot, the COVID-19\nscreening kit “COVID-19 scan”, COVID-19 sniffing dogs and devices, nasal spray,\nautomated vaccine filling machine, survival kits, the “ChulaCov19” mRNA COVID-19\nvaccine and “Chula-Baiya” Protein Subunit Vaccine from tobacco leaves, etc.\nThese innovations are the result of the “Speedboat Strategy” and Chula’s vision for\nthe future under the leadership of Professor Dr. Bundhit Eua-arporn, President of\nChula. “I have set the vision of Innovations for Society as the core of university management\nto harness knowledge and wisdom to make society a better one and to move towards\nbeing a research university that teaches. Chula graduates must be equipped with the\nskills of the 21st century, and possess the quality of global citizens while excelling\nacademically so that they are well recognized by employers around the world. More\nimportantly, university administration must be involved in managing national and global\npublic issues to build a better future society.”\nThis is the direction in which Prof. Dr. Bundhit has been steering Chula toward for the\npast six years. Not only has Chula ranked No. 1 in Thailand for the 3rd consecutive\nyear and top 16 in the world in THE Impact Rankings 2022, but most importantly,\nChula has been maintaining its role as the university that serves and brings continuous change to society in line with the motto “when society is troubled, Chula has the\nsolutions”.\nOn the occasion of the 105th anniversary of the founding of Chulalongkorn University,\nProf. Dr. Bundhit discusses the concepts behind the “Speedboat” strategy, the direction\nand approach of university management, and the university vision aimed to be realized\nin the future.\nThe COVID-19 pandemic has altered societies, the world, and the way people live at all\nlevels and aspects of their lives, including work, school, economic and social life.\nAlthough the pandemic has begun to subside, technological and social disruption will\ncontinue to affect people’s lives and social patterns. The future remains obscure.\nChange is certain. This is a challenging world that higher education institutions must\nembrace, keep abreast with and set trends for the era.\n“Universities need to simplify and focus on goals,” Prof. Dr. Bundhit said of the future\ndirection of higher education institutions. “To manage a university amidst challenges,\nevery organization should set clear goals. When everyone in the organization has\na clear goal, they will devote their full strength to the Need to Do and, and not waste\ntoo much time doing unnecessary things (Nice to do).”\nSince the day of his first appointment as President (2016), Prof. Dr. Bundhit has adopted\nthe “Speedboat” strategy and tailored it in such a way as to make organization\nmanagement leaner and swifter.\n“Why Speedboat Strategy? Chula is a university under government supervision. It is a\nlarge organization with an old structure and rigid system like a big clunky ship with an\noutdated motor. Whether operating, turning, moving forward, or halting, it takes a long\ntime. It is not agile. Nor can it keep up with the changes. In the present and future world,\n changes happen rapidly and there are always new opportunities in store. If you keep\nhanging onto the big ship and heading in one direction, you will not be able to keep up\nwith the game.”\nReforming long-standing systems and institutional structures is not an easy task. Since\npeople in the system are used to the old patterns and systems, a good solution is not to\nknock down old ones, but to create new ones to do new things.\n“We have to break up into smaller boats to do new things, which requires new\npeople. In addition, we also need to set up a new working team of agile members\nwith a positive attitude who can seek new opportunities in different directions and\nenvironments to deliver quality work that benefits society.” explains Prof. Dr.\nBundhit.\nOver the past few years, many of Chula’s “Speedboats” have pioneered new waters and\nproven the success of this strategy that has disrupted the society. Innovation Hub\n(iHub), for instance, which has incubated over 300 start-ups with portfolios of commercial\ninnovations that have generated almost 17 billion baht market valuation; the BaScii\nprogram that has signed an MoU with the Sutardja Center for Entrepreneurship and\nTechnology (SCET) of the University of California, Berkeley granting Chula students the\nopportunity to learn innovative startup how-tos in Silicon Valley (Boot camp, Silicon\nValley Innovation Leadership Program); CU Enterprise (CUE) that supports Chula’s\nstartups by raising funds from the government and private sectors to create and develop\ninnovations that benefit the country; Degree Plus program, an open education platform\nthat promotes “Online with Human Touch” education\ndissemination to the general public. The main product of the university is its “people”. Chula focuses on creating future\nleaders or leaders who go out to serve society. The modern world needs leaders who\nhave the skills and competencies to learn and apply knowledge to make them work in\nthe real world.\n “Aside from academic knowledge, Chula students need to be cultivated for\ncompetency to solve complex problems and have good characteristics to manage\nand live in a fast-changing, tough, creative and out-of-the-box world.”\nTherefore, Chula’s direction and the people-building process have changed from the kind\nof teaching, in which students sit and listen to lectures in class, to students and\nprofessors learning together through research and knowledge application to solve real\u0002world social problems.\n“In today’s world, knowledge is accessible without teachers, and knowledge is constantly\nchanging. We can see that much of the knowledge has become obsolete, such as some\n financial knowledge. These days, there are blockchains, mobile payments, QR-code\npayments, and so on. Yet, skills and competency in applying knowledge for useful\npurposes will always be with the learners. If graduates of Chula have the skills and\ncompetencies, they will be able to learn on their own, exchange knowledge with others,\ncreate new knowledge, and keep on using it to benefit society.” The future direction of higher education institutions cannot focus on teaching knowledge\nin general, but rather to build specific knowledge that is appropriate to the social context\nand the problems of the society (which are always changing).\n“Up until recently, Chula has been a Teaching University that produces research with the\nmain focus on teaching, and research as secondary. But with the direction of creating\npeople to build the future, Chula has transformed itself into a Research University that\nteaches, which means that the professors must build upon the available knowledge in\nresearch, or connect with the outside world, and then pass on the practical experience\nand knowledge to students to gain specific knowledge.”\nProf. Dr. Bundhit elaborates on specific knowledge that is beneficial to the society that it\nderives from 1) research, 2) participation in the actual application of knowledge in solving\nproblems, and 3) students going outside the university context to work in the real world\n(active learning, problem-based learning) and inviting outside professors for discussion.\n Over the past few years under the pandemic and the “Speedboat” strategy, Chula has\noverhauled its curriculum to meet more of the global needs, such as the BaScii\ncurriculum which integrates arts, social sciences, and science. The GenEd curriculum\nhas also been updated to provide students with a general education that’s more attuned\nto the social contexts, etc. In addition, learning processes have been migrated from legacy systems using\npurchased Learning Management System (LMS), such as BlackBoard to Chula’s own\nLMS, MyCourseVille. Also, support systems for teaching and learning as well as\nacademic work have been developed, i.e., Digital Transformation through CUNEX App\nand a lifelong learning support system through Chula Mooc, CU Neuron, etc.Chula focuses on the policy to underline and support innovative research that creates a\npositive impact on society and reduces external dependence. During the COViD-19\ncrisis, many of Chula’s innovations have served the public, including vaccine research, a\nnasal spray, patient care robots, automated vaccine filling machines, survival kits, etc.\nTo achieve success and make a positive impact, every study requires funding and\nsupport from various sources. Chula has therefore established CU Enterprise (CUE) as\na funding and market mechanism for research and innovations. Chulalongkorn\nUniversity Technology Center (UTC) and Siam Innovation District (SID) have also\nbeen created to aid researchers in applying their innovations to solve real problems,\nreorient their work to the needs of consumers, and benefit society while expanding their\npresence in the consumer market as startups producing innovative products.\n “When we broke up the big ship into speedboats, many people in the big ship were\ndissatisfied, couldn’t see why we had to do it and didn’t realize that if we kept tethering\nthe speedboats to us (the big ship, Chula), new jobs wouldn’t be created. Some workers\noften claimed to be restricted by the rules and regulations. Those were just “scapegoats”.\nPeople who don’t want to change often find excuses for not changing, thinking ‘it’s okay.\nI’ll get paid anyway.’ This is a challenge for public university management.”\n“Chula has a large pool of talented people who can be divided into two main categories:\ngood at form, and good at creating results. I give weight to the latter — those who are\ngood at creating results. This group of people will find a way out when they encounter\nproblems. For this group, I will give them freedom, and guidance, but not directions. I’ll\ngive them support and opportunities to work easily and produce good results. Although I\nmay not agree with them 100 percent, if no damage is done, I’ll give them a chance to\ntry. It’s okay for them to try and fail because they will find solutions and solve problems\nto gain good results.”\nFor the Chula President, the art and science of management are to use “compassion”\nand “wisdom” suitable for the type of people and timing.\n“When we have a big workload, we use a lot of wisdom. Whenever we depend on a lot of\nwisdom, our compassion may dwindle, and we may even insult others. But if we use\ncompassion together with wisdom, we’ll develop an understanding – the understanding\nof the existing system, the responsibilities of our people, the external context of the\nuniversity that is connected to internal factors. This will make us understand why they didn’t understand what we tried to do, and why they couldn’t do it. We’ll go and help\nthem look for the reasons. If it can be solved, we’ll help them fix it right away.”\nWith Prof. Dr. Bundhit at its helm for the past six years, Chula has made many\ncontributions that have had a positive impact on society. The amount of research on\ninnovations that have ties with the private sector has increased every year. The CUE\nresearch department has received increased funding. More research and social\nactivities are communicated in the form of academic articles to outsiders. These have\nmoved Chula up the best university ranking list every year.\n“There are still a lot of things I haven’t done. But if we set a little higher goal, even if we\ndon’t reach those high goals, there is a greater chance of success. The next step for\nChula that I hope for is that Chula can soon be even better in all dimensions, including\nacademic, as well as research and innovation in which all members of the Chula\ncommunity have invested for the past six years. This means that Chula needs to alter its\nstructure and work to keep up with a rapidly changing world,” Prof. Dr. Bundhit\nconcluded."
  },
  {
    "university": "Chulalongkorn university",
    "country": "Thailand",
    "title": "Siam Piwat Embarks on a Research and Innovation\nPartnership with Chulalongkorn University\n",
    "content": "Introducing Degree Plus for the development of new-generation leaders to support\ncreative business of the future.\n Advancing its Collaboration to Win concept, Siam Piwat Co., Ltd., Thailand’s leader of\nretail and real estate innovation, owner and operator of world-class projects, such as\nSiam Paragon, Siam Center, and Siam Discovery, and a joint venture partner of\nICONSIAM and Siam Premium Outlets Bangkok, has announced a collaborative\nresearch and innovation partnership with Chulalongkorn (CU) to develop a new\ngeneration of leaders to accommodate future demand in the business sector. Driven by\nDegree Plus, a future skill platform for human development in the digital era, and the\nSchool of Integrated Innovation of Chulalongkorn University (ScII), which strives to\ncreate leaders and graduates for the future, this new collaboration will see Siam Piwat\nand CU joining forces to accelerate human capital development to further advance\nThailand’s economy.\nMs. Amporn Chotruchsakul, President of Business Support, Siam Piwat Co., Ltd., said,\n“In an age where technology is playing an increasingly vital role in business, Siam Piwat,\nas The Visionary Icon, has adjusted its strategies and plans to expand towards new\nbusinesses to build a New Economy beyond real estate development, its central sphere\nin the past, as well as initiated digital transformation to seamlessly integrate offline and\nonline worlds and deliver extraordinary and unprecedented experiences to customers\nwhile also advancing the organisation to secure innovation leadership and accommodate\nfuture business expansion. However, to turn new business models into reality and co\u0002develop future world-class projects, it is necessary to develop personnel with future\nknowledge and skills.”\n“To this end, Siam Piwat has partnered with Chulalongkorn University, which has a\nnetwork of future skill development consisting of Degree Plus, a future skill development\nplatform, and the School of Integrated Innovation of Chulalongkorn University (ScII). In\nline with Siam Piwat’s Collaboration to Win concept, the research and innovation\npartnership between the educational institution and the world-class private organisation\nseeks to develop new-generation leaders to meet the demand of the business sector.”\n Siam Piwat has also invited Assoc. Prof. Natcha Thawesaengskulthai, Ph.D., Vice\nPresident for Innovation and New Development of Chulalongkorn University and a\npersonnel development expert, to serve as consultant on human capability development\nacross all dimensions to support business needs in the digital era and join the Human\nCapital Acceleration Program, which places emphasis on future skills for next-generation\nleaders.\nAssoc. Prof. Natcha Thawesaengskulthai, Ph.D., Vice President at Chulalongkorn\nUniversity (CU), stated, “This collaboration with Siam Piwat underscores CU’s “Research\nUniversity That Teaches” concept and will be undertaken within a framework consisting\nof three pillars: education, innovation, and research.”\nFor education, Siam Piwat and CU will co-develop a curriculum that accelerates\ncapabilities development across all dimensions, where learners can undergo skill\nacceleration towards becoming future leaders under the guidance of CU faculty and\nbona fide experts via the new jointly-developed platform Degree Plus.\nAs for innovation, Siam Piwat has given students in the School of Integrated\nInnovation (ScII) the opportunity to learn from real-life experience through hands-on\ntasks with Siam Piwat’s personnel. Promising innovation projects may also be\ndeveloped into real businesses, which will simultaneously contribute to the\ndevelopment of both human capital and the economy.\nLastly, the research pillar involves conducting research alongside s skill development\nand innovation project with co-development, culminating in the Human Capital\nAcceleration Project, which seeks to advance the development of the country’s\ninnovation and economy going forward at the same time.\nThis partnership marks a seismic shift for Siam Piwat away from just the current\nlandscape towards changes in the overall picture and preparation of personnel for the\nbusiness sector. Homing in on the new generation, this initiative gives students an\nopportunity to learn and gain hands-on experience via the online platform Degree Plus\n Through a series of key projects to be released soon to develop a new generation of\nleaders who can make a creative contribution to Thailand.\n"
  },
  {
    "university": "Chulalongkorn university",
    "country": "Thailand",
    "title": "Chula Employs the “Speedboat Strategy”\nto Drive Innovations for Society",
    "content": "To celebrate its 105th anniversary, Chula President announces\nthe success of the “Speedboat Strategy” in managing the\nuniversity in a volatile situation to drive social innovations,\nfocusing on being a research university that teaches, revising\nits curriculum, and building graduates’ competencies in line\nwith the world of the future. During the past few and rather difficult years most of us have faced with the COVID-19\npandemic, Chulalongkorn University has launched several innovations and studies to\nserve the society, such as CU-RoboCovid – a medical support robot, the COVID-19\nscreening kit “COVID-19 scan”, COVID-19 sniffing dogs and devices, nasal spray,\nautomated vaccine filling machine, survival kits, the “ChulaCov19” mRNA COVID-19\nvaccine and “Chula-Baiya” Protein Subunit Vaccine from tobacco leaves, etc.\nThese innovations are the result of the “Speedboat Strategy” and Chula’s vision for\nthe future under the leadership of Professor Dr. Bundhit Eua-arporn, President of\nChula.\n “I have set the vision of Innovations for Society as the core of university management\nto harness knowledge and wisdom to make society a better one and to move towards\nbeing a research university that teaches. Chula graduates must be equipped with the\nskills of the 21st century, and possess the quality of global citizens while excelling\nacademically so that they are well recognized by employers around the world. More\nimportantly, university administration must be involved in managing national and global\npublic issues to build a better future society.”\nThis is the direction in which Prof. Dr. Bundhit has been steering Chula toward for the\npast six years. Not only has Chula ranked No. 1 in Thailand for the 3rd consecutive\nyear and top 16 in the world in THE Impact Rankings 2022, but most importantly,\nChula has been maintaining its role as the university that serves and brings continuous change to society in line with the motto “when society is troubled, Chula has the\nsolutions”.\nOn the occasion of the 105th anniversary of the founding of Chulalongkorn University,\nProf. Dr. Bundhit discusses the concepts behind the “Speedboat” strategy, the direction\nand approach of university management, and the university vision aimed to be realized\nin the future.\nThe COVID-19 pandemic has altered societies, the world, and the way people live at all\nlevels and aspects of their lives, including work, school, economic and social life.\nAlthough the pandemic has begun to subside, technological and social disruption will\ncontinue to affect people’s lives and social patterns. The future remains obscure.\nChange is certain. This is a challenging world that higher education institutions must\nembrace, keep abreast with and set trends for the era.\n“Universities need to simplify and focus on goals,” Prof. Dr. Bundhit said of the future\ndirection of higher education institutions. “To manage a university amidst challenges,\nevery organization should set clear goals. When everyone in the organization has\na clear goal, they will devote their full strength to the Need to Do and, and not waste\ntoo much time doing unnecessary things (Nice to do).”\nSince the day of his first appointment as President (2016), Prof. Dr. Bundhit has adopted\nthe “Speedboat” strategy and tailored it in such a way as to make organization\nmanagement leaner and swifter.\n“Why Speedboat Strategy? Chula is a university under government supervision. It is a\nlarge organization with an old structure and rigid system like a big clunky ship with an\noutdated motor. Whether operating, turning, moving forward, or halting, it takes a long\ntime. It is not agile. Nor can it keep up with the changes. In the present and future world,\n changes happen rapidly and there are always new opportunities in store. If you keep\nhanging onto the big ship and heading in one direction, you will not be able to keep up\nwith the game.”\nReforming long-standing systems and institutional structures is not an easy task. Since\npeople in the system are used to the old patterns and systems, a good solution is not to\nknock down old ones, but to create new ones to do new things.\n“We have to break up into smaller boats to do new things, which requires new\npeople. In addition, we also need to set up a new working team of agile members\nwith a positive attitude who can seek new opportunities in different directions and\nenvironments to deliver quality work that benefits society.” explains Prof. Dr.\nBundhit.\nOver the past few years, many of Chula’s “Speedboats” have pioneered new waters and\nproven the success of this strategy that has disrupted the society. Innovation Hub\n(iHub), for instance, which has incubated over 300 start-ups with portfolios of commercial\ninnovations that have generated almost 17 billion baht market valuation; the BaScii\nprogram that has signed an MoU with the Sutardja Center for Entrepreneurship and\nTechnology (SCET) of the University of California, Berkeley granting Chula students the\nopportunity to learn innovative startup how-tos in Silicon Valley (Boot camp, Silicon\nValley Innovation Leadership Program); CU Enterprise (CUE) that supports Chula’s\nstartups by raising funds from the government and private sectors to create and develop\ninnovations that benefit the country; Degree Plus program, an open education platform\nthat promotes “Online with Human Touch” education\ndissemination to the general public. The main product of the university is its “people”. Chula focuses on creating future\nleaders or leaders who go out to serve society. The modern world needs leaders who\nhave the skills and competencies to learn and apply knowledge to make them work in\nthe real world.\n“Aside from academic knowledge, Chula students need to be cultivated for\ncompetency to solve complex problems and have good characteristics to manage\nand live in a fast-changing, tough, creative and out-of-the-box world.”\nTherefore, Chula’s direction and the people-building process have changed from the kind\nof teaching, in which students sit and listen to lectures in class, to students and\nprofessors learning together through research and knowledge application to solve real\u0002world social problems.\n“In today’s world, knowledge is accessible without teachers, and knowledge is constantly\nchanging. We can see that much of the knowledge has become obsolete, such as some\n financial knowledge. These days, there are blockchains, mobile payments, QR-code\npayments, and so on. Yet, skills and competency in applying knowledge for useful\npurposes will always be with the learners. If graduates of Chula have the skills and\ncompetencies, they will be able to learn on their own, exchange knowledge with others,\ncreate new knowledge, and keep on using it to benefit society.”\nThe future direction of higher education institutions cannot focus on teaching knowledge\nin general, but rather to build specific knowledge that is appropriate to the social context\nand the problems of the society (which are always changing).\n“Up until recently, Chula has been a Teaching University that produces research with the\nmain focus on teaching, and research as secondary. But with the direction of creating\npeople to build the future, Chula has transformed itself into a Research University that\nteaches, which means that the professors must build upon the available knowledge in\nresearch, or connect with the outside world, and then pass on the practical experience\nand knowledge to students to gain specific knowledge.”\nProf. Dr. Bundhit elaborates on specific knowledge that is beneficial to the society that it\nderives from 1) research, 2) participation in the actual application of knowledge in solving\nproblems, and 3) students going outside the university context to work in the real world\n(active learning, problem-based learning) and inviting outside professors for discussion.\nOver the past few years under the pandemic and the “Speedboat” strategy, Chula has\noverhauled its curriculum to meet more of the global needs, such as the BaScii\ncurriculum which integrates arts, social sciences, and science. The GenEd curriculum\nhas also been updated to provide students with a general education that’s more attuned\nto the social contexts, etc. In addition, learning processes have been migrated from legacy systems using\npurchased Learning Management System (LMS), such as BlackBoard to Chula’s own\nLMS, MyCourseVille. Also, support systems for teaching and learning as well as\nacademic work have been developed, i.e., Digital Transformation through CUNEX App\nand a lifelong learning support system through Chula Mooc, CU Neuron, etc.\nChula focuses on the policy to underline and support innovative research that creates a\npositive impact on society and reduces external dependence. During the COViD-19\ncrisis, many of Chula’s innovations have served the public, including vaccine research, a\nnasal spray, patient care robots, automated vaccine filling machines, survival kits, etc.\nTo achieve success and make a positive impact, every study requires funding and\nsupport from various sources. Chula has therefore established CU Enterprise (CUE) as\na funding and market mechanism for research and innovations. Chulalongkorn\nUniversity Technology Center (UTC) and Siam Innovation District (SID) have also\nbeen created to aid researchers in applying their innovations to solve real problems,\nreorient their work to the needs of consumers, and benefit society while expanding their\npresence in the consumer market as startups producing innovative products.\n Every change, especially for large and old organizations, encounters friction.\n“When we broke up the big ship into speedboats, many people in the big ship were\ndissatisfied, couldn’t see why we had to do it and didn’t realize that if we kept tethering\nthe speedboats to us (the big ship, Chula), new jobs wouldn’t be created. Some workers\noften claimed to be restricted by the rules and regulations. Those were just “scapegoats”.\nPeople who don’t want to change often find excuses for not changing, thinking ‘it’s okay.\nI’ll get paid anyway.’ This is a challenge for public university management.”\n“Chula has a large pool of talented people who can be divided into two main categories:\ngood at form, and good at creating results. I give weight to the latter — those who are\ngood at creating results. This group of people will find a way out when they encounter\nproblems. For this group, I will give them freedom, and guidance, but not directions. I’ll\ngive them support and opportunities to work easily and produce good results. Although I\nmay not agree with them 100 percent, if no damage is done, I’ll give them a chance to\ntry. It’s okay for them to try and fail because they will find solutions and solve problems\nto gain good results.”\nFor the Chula President, the art and science of management are to use “compassion”\nand “wisdom” suitable for the type of people and timing.\n“When we have a big workload, we use a lot of wisdom. Whenever we depend on a lot of\nwisdom, our compassion may dwindle, and we may even insult others. But if we use\ncompassion together with wisdom, we’ll develop an understanding – the understanding\nof the existing system, the responsibilities of our people, the external context of the\nuniversity that is connected to internal factors. This will make us understand why they\n didn’t understand what we tried to do, and why they couldn’t do it. We’ll go and help\nthem look for the reasons. If it can be solved, we’ll help them fix it right away.”\nWith Prof. Dr. Bundhit at its helm for the past six years, Chula has made many\ncontributions that have had a positive impact on society. The amount of research on\ninnovations that have ties with the private sector has increased every year. The CUE\nresearch department has received increased funding. More research and social\nactivities are communicated in the form of academic articles to outsiders. These have\nmoved Chula up the best university ranking list every year.\n“There are still a lot of things I haven’t done. But if we set a little higher goal, even if we\ndon’t reach those high goals, there is a greater chance of success. The next step for\nChula that I hope for is that Chula can soon be even better in all dimensions, including\nacademic, as well as research and innovation in which all members of the Chula\ncommunity have invested for the past six years. This means that Chula needs to alter its\nstructure and work to keep up with a rapidly changing world,” Prof. Dr. Bundhit\nconcluded."
  }
]