[
  {
    "university": "Pontificia Universidad Catolica de Chile",
    "country": "Chile",
    "title": "Nace ContectIA: UC y Microsoft unidos para impulsar la adopción de inteligencia artificial en Chile",
    "content": "La iniciativa fue presentada a la comunidad universitaria y tiene como principal propósito contribuir a la transformación digital y el desarrollo de esta tecnología, impactando en Chile y en América Latina. En la ocasión se compartió la plataforma AcademiaIA, que incluye 175 recursos de aprendizaje, además de información sobre eventos y herramientas, siempre relacionado al uso de la inteligencia artificial. “Conect IA” es el nombre de la nueva alianza colaborativa desarrollada por la Universidad Católica y Microsoft. Como indica su lema, el propósito de esta iniciativa es impulsar la inteligencia artificial en Chile y también en América Latina. \n\nEn una presentación realizada en el Salón de Honor de la UC se compartieron con la comunidad universitaria los avances de este trabajo conjunto y se expuso AcademiaIA, una plataforma gratuita para quienes estudian, enseñan y trabajan en esta institución de educación superior, y que incluye 175 recursos y herramientas para el uso de la inteligencia artificial (IA).“La inteligencia artificial es una de las tecnologías más transformadoras de nuestro tiempo. Tiene el potencial de mejorar la calidad de vida de las personas, generar nuevos conocimientos y soluciones a los problemas más complejos de nuestra sociedad, y crear nuevas oportunidades de desarrollo económico y social”, sostuvo el rector de la UC Ignacio Sánchez.   \n\nLa autoridad universitaria valoró la alianza estratégica que se ha articulado con Microsoft, empresa líder mundial en el desarrollo tecnológico, y enfatizó que “como universidad comprometida con nuestra sociedad y la excelencia académica, la Universidad Católica no puede quedar al margen de esta revolución tecnológica, sino que debe ser un actor protagónico y una referencia regional en el desarrollo e investigación de la inteligencia artificial, así como en su aplicación responsable a los diversos ámbitos de nuestra misión universitaria”. El Plan de Desarrollo de la UC 2020-2025 tiene entre sus principales ejes la transformación digital. Se trata de un proceso en el que se busca que las personas puedan interactuar directamente con la tecnología y los datos, y también adoptar una cultura que aproveche los beneficios de esta transformación. Uno de los desafíos es además crecientemente ir integrando estas tecnologías en las prácticas de enseñanza, en la investigación y también en la gestión organizacional. “Como universidad comprometida con nuestra sociedad y la excelencia académica, la Universidad Católica no puede quedar al margen de esta revolución tecnológica, sino que debe ser un actor protagónico y una referencia regional en el desarrollo e investigación de la inteligencia artificial\" - Ignacio Sánchez, rector de la UC. El prorrector de la UC Guillermo Marshall, quien ha sido uno de los principales impulsores del proyecto ConectIA, sostuvo que los efectos de esta iniciativa pueden ser muy significativos también en el ámbito formativo. \"Esta alianza nos permite ser protagonistas y líderes de una revolución tecnológica cuyos alcances son hoy difíciles de dimensionar. Es muy probable que ello implicará en un futuro muy cercano, revisar los programas académicos, los procesos de enseñanzas-aprendizaje y las formas de evaluación a nuestros estudiantes\", afirmó. \"Esta alianza nos permite ser protagonistas y líderes de una revolución tecnológica cuyos alcances son hoy difíciles de dimensionar. Es muy probable que ello implicará en un futuro muy cercano, revisar los programas académicos, los procesos de enseñanzas-aprendizaje y las formas de evaluación a nuestros estudiantes\" - Guillermo Marshall, prorrector UC Incorporando la IA en las entidades de educación \nBruce Thompson, director de Educación de Microsoft para las Américas y experto en materia tecnológica, expuso sobre cómo las instituciones de educación superior pueden hoy aprovechar eficientemente la inteligencia artificial, compartiendo para ello diferentes ejemplos e iniciativas internacionales. “La inteligencia artificial va a cambiar la forma en que los estudiantes reciben la información, lo cual genera un impacto en el currículum, en el diseño instruccional”, afirmó.\n\nDestacó que para que se le pueda sacar el máximo potencial a la IA es importante unir la estrategia institucional con la tecnológica, lo que requiere superar diferentes retos y también incorporar cambios culturales proclives a la adopción de estas tecnologías. En ese sentido, el directivo explicó que resulta esencial definir objetivos concretos en la incorporación de la inteligencia artificial, así como metas a nivel de unidades académicas y entidades centrales de la administración de la universidad. \n\n“La inteligencia artificial va a cambiar la forma en que los estudiantes reciben la información, lo cual genera un impacto en el currículum, en el diseño instruccional” -  Bruce Thompson, director de Educación, Microsoft para las Américas. Para la incorporación de la IA al interior de la universidad, Thompson sostuvo que resulta relevante entregar directrices y ayudas para facilitar el aprendizaje, por ejemplo, enseñando sobre cómo realizar las preguntas precisas a las herramientas de inteligencia artificial, para que así entreguen respuestas correctas. Por otro lado, enfatizó las hackathones “como otra forma de promover la introducción de la IA, en las que estudiantes con conocimientos en programación logran crear soluciones para ciertos retos que se les proponen. El directivo afirmó que la UC, a través de su liderazgo, puede además convertirse en un referente tanto para Chile como para la región en estos temas, en la medida que incorpore exitosamente estas tecnologías. \n\nEl experto de Microsoft compartió distintos ejemplos de cómo entidades escolares y universidades en Estados Unidos habían logrado disminuir la carga de trabajo a través del uso de IA. El sistema de colegios de la ciudad de Nueva York, que cuenta con 1,2 millones de escolares, desarrolló un 'tutor-bot' que los asiste. En el caso de la Universidad de Michigan, los académicos e investigadores cuentan con el apoyo de bots que los ayudan para realizar su trabajo de investigación de manera más rápida y eficiente. En tanto, la Universidad Seneca de Canadá ha desarrollado un servicio para encontrar trabajo basado en IA, facilitándole a los estudiantes la posibilidad de entrenarse y realizar simulaciones de entrevistas de trabajo para determinadas compañías.  \n\n“Es importante desarrollar habilidades y sobre todo que los estudiantes y académicos de la universidad aprendan en materia de IA”, puntualizó Bruce Thompson.     \n\nAvances de la alianza \nEl primer paso de ConectIA se dio a fines del año pasado cuando la Universidad Católica firmó un convenio con Microsoft, una de las principales multinacionales tecnológicas del mundo. El acuerdo de colaboración suscrito tiene como propósito “construir y liderar un horizonte de vanguardia en materia de transformación digital a través de la integración de inteligencia artificial, con el propósito de generar impacto tanto en el quehacer propio de la universidad, como en Chile y la región”.  \n\nSegún explicó María Francisca Yáñez, directora de la Oficina Nacional Tecnológica de Microsoft, “la alianza no sólo está centrada en la tecnología y en la IA, sino que también en los retos académicos, en la investigación y en las experiencias educativas”. A partir justamente de los desafíos propios de la UC, se definieron 31 iniciativas a trabajar durante los próximos cinco años. \n “Una de las grandes deficiencias que tienen actualmente las empresas e instituciones para adoptar tecnologías como las relacionadas a la IA está el hecho de que les falta equipos capacitados. Por lo tanto, el rol de la universidad de mover la frontera del conocimiento y de formar a estudiantes y equipos de trabajo es clave”, dijo María Francisca Yáñez.\n\nConectIA considera objetivos comunes entre la UC y Microsoft en torno a comprender que la transformación digital y la implementación de tecnologías como la IA debe darse por etapas, en las que la inteligencia artificial constituye un eje clave, y donde siempre se tendrá muy en consideración la misión y visión universitaria. “Una de las grandes deficiencias que tienen actualmente las empresas e instituciones para adoptar tecnologías como las relacionadas a la IA está el hecho de que les falta equipos capacitados. Por lo tanto, el rol de la universidad de mover la frontera del conocimiento y de formar a estudiantes y equipos de trabajo es clave” - María Francisca Yáñez, directora de la Oficina Nacional Tecnológica de Microsoft. Mauricio Bernabó, director de Transformación Digital UC, dio a conocer algunas de las 31 iniciativas que se están promoviendo en esta fase de la alianza. Es así como se está desarrollando un chatbot al interior de la UC, un programa que utiliza inteligencia artificial para comprender preguntas y responderlas, a similitud de una conversación humana. “Estamos trabajando en aprovechar toda la información que tiene la universidad para poder hacerle preguntas al chatbot y tener respuestas muy rápidas. Esperamos incluir todos los reglamentos, datos relativos a las unidades académicas, carreras, y otro tipo de información, lo cual va a ser muy útil para todas las personas que podrán acceder desde diversos dispositivos”, explicó Bernabó.\n\n“Estamos haciendo diversas pruebas de cómo a través de toda la data de la universidad, que está en internet, se pueden hacer de manera muy rápida diversos análisis por carrera y facultades\" - Mauricio Bernabó, director de Transformación Digital UC Copilot, un sistema de inteligencia artificial desarrollado por Microsoft, es otra de las herramientas que se están utilizando ya en la universidad, y que al estar conectada a internet permite contar siempre con información actualizada. Entre sus variadas funciones sirve para buscar datos, resumir conversaciones, solicitarle la creación de contenidos, diseño de imágenes, a semejanza de otras plataformas, como ChatGPT. \n\nUna tercera iniciativa consiste en aprovechar a través de la IA toda la información que dispone la universidad, con sistemas de reportería. “Estamos haciendo diversas pruebas de cómo a través de toda la data de la universidad, que está en internet, se pueden hacer de manera muy rápida diversos análisis por carrera y facultades\", puntualizó el director de Transformación Digital y agregó que todos los miembros de la comunidad universitaria están invitados a ser protagonistas activos de esta alianza. Aprendizaje en línea de la IA \nBajo el enfoque de que son las personas las que están al centro de las instituciones y de los procesos de cambio, se determinó que es importante entregarles un acceso a las múltiples herramientas que existen para aprender acerca de la inteligencia artificial. Es justamente por esto que se desarrolló la plataforma AcademiaIA, a la cual los miembros de la comunidad universitaria pueden acceder gratuitamente a cursos generados por Microsoft. Actualmente, se disponen de 175 recursos disponibles, entre los cuales hay cursos para principiantes, personas con conocimientos intermedios y también avanzados sobre conceptos básicos de la IA, contenidos relativos a la adopción de las prácticas y principios de IA responsable, entrenamiento de modelos de aprendizaje profundo en softwares, entre otros.  \n\nSegún expuso Francisco Quiroga, subdirector de Tecnologías Institucionales de la UC, “entre las metas propuestas se encuentra garantizar el acceso a recursos de aprendizaje formales sobre inteligencia artificial, crear eventos y espacios colaborativos que promuevan el intercambio de ideas y experiencias sobre IA, y proporcionar herramientas que faciliten la adopción de tecnologías basadas en IA en las actividades diarias”. \n\nAcademiaIA está dirigida al cuerpo académico, estudiantes, y el equipo de profesionales y administrativos de la universidad.  \n\nAsociado a esta plataforma se organizarán además diversos eventos. El más próximo será la charla sobre “Cómo crear contenido con IA generativa” que dará el 23 de mayo a las 15:00, Sylvie Duchamp, directora de Comunicaciones Externas de Microsoft para Sudamérica. Por otro lado, se lanzó recientemente también un curso y certificación sobre los Fundamentos de Azure AI, otra plataforma que tiene la empresa Microsoft.    "
  },
  {
    "university": "Pontificia Universidad Catolica de Chile",
    "country": "Chile",
    "title": "UC será la primera ciudad inteligente a escala de Chile",
    "content": "Se trata de ocho proyectos ya habilitados, en su primera fase, para cubrir cuatro ámbitos clave: medio ambiente, movilidad, seguridad y recursos habilitantes para realizar las transformaciones tecnológicas al interior del Campus San Joaquín. La idea es que luego sean replicados por distintos municipios para avanzar hacia un \"Santiago inteligente\" y mejorar la calidad de vida de sus habitantes. ¿Qué se entiende por una smart city o ciudad inteligente? El Banco Interamericano de Desarrollo la describe como un espacio territorial que pone a las personas en el centro del desarrollo, que incorpora tecnologías en la gestión urbana y que usa estos elementos para estimular la formación de un gobierno eficiente, que haga de las urbes espacios más resilientes y eficientes.\n\nBajo esta premisa, entre 2022 y el 2023 se ha estado creando la primera ciudad inteligente a escala del país en el Campus San Joaquín de la UC. Esto, gracias a una iniciativa liderada por una alianza entre Lab Claro-Centro de Innovación UC 5G y \"Sé Santiago\", programa estratégico de CORFO Metropolitano y Fundación País Digital.\n\nEl proyecto busca implementar soluciones tecnológicas habilitadas con 5G, con el objetivo de mejorar el bienestar de las personas. La idea es probar distintas tecnologías para que luego puedan ser replicadas por los municipios.\n\nEl trabajo de implementación ya comenzó, con ocho tecnologías desplegadas en el campus, en áreas como medio ambiente, movilidad, seguridad y recursos habilitantes para generar los cambios tecnológicos, entre otras.\n\nDesde que se empezó a trabajar en la “Ciudad Inteligente a Escala”, se supo que era un proyecto desafiante. Pero que a pesar de su complejidad, como explica Francisco Pizarro, subdirector del área de I+D con la Industria del Centro de Innovación UC Anacleto Angelini, “contábamos con tres ítem fundamentales para llevarlo a la práctica: un espacio demostrativo en el que los gobiernos regionales pudieran ver cómo usar estas tecnologías; un espacio para poder prototipar y generar soluciones desde la academia; y un lugar de encuentro para trabajar con emprendedores en modelos de innovación abierta”.\n\nEs por eso que no solo se puso a disposición el campus San Joaquín, sus profesionales y el portafolio de emprendedores, sino que también la capacidad de coordinar el desafío de entregar soluciones de impacto que mejoren la calidad de vida de los habitantes. “Algo que es el objetivo de las ciudades inteligentes”, dice el profesional.\n\nEste proyecto contempla, además, el despliegue de infraestructura que combina tecnologías como fibra óptica, 5G, 5G stand alone o independiente, e IoT (Internet de las cosas, en su sigla en inglés), todos ellos elementos clave para migrar desde una gestión tradicional a la ciudad inteligente. Por último, también cuenta con el apoyo delas empresas Nokia y Qualcomm.\n\nUna iniciativa de frontera\nDe acuerdo al rector Ignacio Sánchez, la iniciativa responde a los desafíos actuales y futuros que nos plantea el desarrollo de los núcleos urbanos y el uso eficiente de la tecnología, desarrollando pruebas de concepto que sean escalables a nivel empresarial y territorial, ya que son tecnologías habilitantes que ofrecen una mejor coordinación, menores costos y, sobre todo, una mejor gestión del territorio.\n\n“Esta oportunidad refuerza la importancia de la colaboración entre academia, industria y el sector público, para el beneficio de la sociedad civil, lo que hemos estamos impulsando con fuerza desde la UC”, afirmó el rector cuando se anunció la iniciativa, en agosto de 2022.\n\nEn 2023, la alianza entrará en una segunda etapa, en la cual se integrarán nuevas áreas como energía, iluminación, gestión de residuos, entretenimiento, educación, gestión de agua y economía.\n\nA continuación se presentan las ocho soluciones tecnológicas que ya entraron en funcionamiento en el Campus San Joaquín. Tecnologías de seguridad\n1. WCS\n\nEs una tecnología de video analítica para apoyar la seguridad física en calles, interiores como empresas, municipios, fábricas, entre otros, con inteligencia y data que permite la prevención en seguridad. En el Campus San Joaquín, se integrará en tiempo real al circuito cerrado de cámaras del recinto y así se podrán obtener alertas inmediatas en caso de cualquier evento inusual.\n\n2. Smert\n\nSolución que consiste en recopilar la información crítica de respuesta a emergencias y desplegarla en un código QR en la entrada de los edificios para que los equipos de emergencia puedan actuar rápidamente. De esta manera, en el campus permitirá la gestión de bomberos en forma rápida, pudiendo visualizar rápidamente el mapa de la instalaciones, para abordar efectivamente la contingencia.\n\nRecursos habilitantes en Seguridad\n3. Juganu/Omniflow\n\nEs un modelo de iluminación creado en Portugal, que es autosustentable a través del uso de energía eólica y fotovoltaica. Se trata de luminarias inteligentes, capaces de realizar videoanalítica en tiempo real y de proveer con cobertura de red a los transeúntes. En concreto, es un foco de iluminación con inteligencia artificial y sensores ambientales, que permite captar movimientos, optimizar el tráfico, identificar señales de socorro, actividad sospechosa y densidad de población.\n\nMedioambiente 4. IOTree\n\nIntegración de indicadores ambientales complejos de alta resolución sobre la salud de los ecosistemas urbanos para el monitoreo a través de imágenes multiespectrales. En concreto, la solución permitirá obtener indicadores ambientales complejos acerca de la salud de los árboles del campus, tales como la calidad de fotosíntesis o enfermedades.\n\n5. BeeWaze\n\nLa iniciativa monitorea las condiciones ambientales dentro y fuera de colmenas, tales como temperatura, humedad y peso, generando pronósticos e información histórica del lugar. De este modo, el apicultor podrá tomar las acciones necesarias que ayuden a reducir la muerte de sus abejas, aumentando así la productividad del apiario.\n\n6. SmartFarming\n\nEs una solución para la agricultura que consiste en una estación de monitoreo de suelo con plantaciones, para el control a partir de distintos datos, tales como la temperatura, humedad, acidez y viento, entre otros.\n\nMedioambiente y movilidad\n7. Proyecto UrbeTrack\n\nNacida en 2007 en Argentina con foco en trazabilidad y logística, es una plataforma 100% digital que ayuda a los municipios a administrar y coordinar planes de trabajo en el espacio público, buscando así aumentar la eficiencia de recursos. Busca gestionar y hacer más eficiente la recolección de residuos, además de permitir la gestión de flotas de vehículos conociendo en tiempo real su geolocalización y trazabilidad.\n\nMovilidad\n8. Geodata\n\nEs un sistema que permite proyectar flujos de personas y autos, a partir de la recolección de la data anónima de personas que se conectan a la red de antenas celulares. Se trata de una herramienta que realizará un análisis continuo de todas las visitas que se producen a diario en el Campus San Joaquín; en función de esa información, las autoridades del campus podrán tomar decisiones respecto a infraestructura y asignación de recursos, entre otros temas. Asimismo, permite a los ciudadanos planificar rutas y lograr así una mayor eficiencia en sus traslados. "
  },
  {
    "university": "Pontificia Universidad Catolica de Chile",
    "country": "Chile",
    "title": "Exestudiantes realizan proceso de cambio de plataforma de almacenamiento y correo electrónico UC",
    "content": "Este 15 de noviembre los exalumnos/as de pre y post grado comienzan a utilizar exclusivamente las herramientas de Microsoft 365. A mediados de noviembre quienes han cursado estudios tanto de pre como de postgrado en la Universidad Católica empezarán a utilizar las herramientas de correo y de almacenamiento de Microsoft 365, realizándose así el proceso de migración desde la plataforma de Google. El proyecto de cambio de almacenamiento y correo electrónico UC es una iniciativa institucional que busca unificar el ecosistema digital por medio de la plataforma Microsoft 365, con el fin de facilitar el acceso a la información, promover la colaboración entre las unidades y mejorar la experiencia de usuario.\n\nSe trata de un proceso que se lleva a cabo en tres etapas. La primera consistió en la habilitación de cuentas Alumni en Microsoft 365, fase que se inició en julio de 2022 y que culmina este 15 de noviembre con la desactivación de la plataforma Google Workspace para exalumnos/as de pre y postgrado. La segunda etapa corresponde a la migración desde Microsoft Exchange a Microsoft 365 de funcionarios y académicos. La tercera fase implicará un proceso de automigración de todas las cuentas de Google Workspace hacia Microsoft 365, entre fines del segundo semestre de 2022 y principios del primer semestre 2023, instancia que incluirá a académicos, estudiantes, funcionarios y otros miembros de la Comunidad UC.\n\nPara Mauricio Bernabó, director de Transformación Digital UC, esta implementación es relevante pues busca “potenciar la colaboración, la coordinación y el intercambio de conocimiento entre las unidades por medio de una plataforma única que evite incompatibilidades y permita una comunicación horizontal entre los diferentes miembros de la Comunidad UC”. Bernabó destaca la necesidad de avanzar en iniciativas de transformación digital “para afrontar de manera eficaz los actuales desafíos y así, mantener los estándares que nos permiten ser reconocidos como una de las mejores universidades de Latinoamérica”.\n\n“Este proyecto busca potenciar la colaboración, la coordinación y el intercambio de conocimiento entre las unidades por medio de una plataforma única que evite incompatibilidades y permita una comunicación horizontal entre los miembros de la Comunidad UC” - Mauricio Bernabó, director de Transformación Digital UC Por lo pronto, la dirección de Transformación Digital junto a la dirección de Informática ha dispuesto una mesa de ayuda, sitio web, sugerencias, tutoriales y material de apoyo para que los exalumnos/as de pre y postgrado puedan rescatar su información, almacenándola en un dispositivo de su elección o bien realizando una automigración hacia Microsoft 365. \n\nPor ahora, los esfuerzos se concentran en apoyar a la Comunidad Alumni en este proceso de transición para luego, informar detalladamente el inicio de la fase de auto migración de estudiantes, académicos y funcionarios UC hacia el nuevo sistema, momento en que se ofrecerán instancias apoyo y material de ayuda para todos los miembros de la Comunidad UC. "
  },
  {
    "university": "Pontificia Universidad Catolica de Chile",
    "country": "Chile",
    "title": "Lanzan innovadora plataforma en línea para apoyar el proceso de tesis doctorales",
    "content": "La Escuela de Graduados impulsa SaGA, un sistema de gestión que permitirá mejorar la experiencia y facilitar la supervisión y acompañamiento de los estudiantes de doctorado. SaGA (Sistema de Gestión y Acompañamiento a la tesis doctoral) es el nombre que recibió una moderna plataforma en línea que servirá para estudiantes, académicos, autoridades y equipos administrativos y profesionales que conforman la comunidad doctoral UC. Se trata de un innovador proyecto que ha impulsado la Escuela de Graduados de la Vicerrectoría de Investigación y que responde a la necesidad de contar con un sistema para la gestión y acompañamiento del proceso de desarrollo de la tesis doctoral.\n\nEn su diseño han participado tanto académicos como profesionales con experiencia en el modelo de formación doctoral UC. Enmarcado en la estrategia de transformación digital de la UC, SaGA inició este proyecto en enero de 2022 con la participación de la Facultad de Ciencias Biológicas y la Dirección Transformación Digital. Este 2024 es un momento clave para el proyecto, ya que comenzó la marcha blanca para la adopción de la plataforma.\n\nLa plataforma se caracteriza por ser una herramienta moderna, amigable, estandarizada y creada a la medida del ecosistema doctoral que contribuirá a mejorar la interacción entre los estudiantes y sus directores de tesis, así como entre autoridades de los programas de doctorado y los equipos de gestión que apoyan a estas duplas. El vicerrector de Investigación, Pedro Bouchon, explica que “este proyecto ha tenido un sello que es la interacción y colaboración de los diferentes programas doctorales, que fueron fundamentales para poder acceder a los desafíos y características particulares, que buscan ser atendidos por esta plataforma”.\n\n\"Este proyecto ha tenido un sello que es la interacción y colaboración de los diferentes programas doctorales\" - Pedro Bouchon, vicerrector de Investigación UC El uso de SAGA facilitará el proceso de seguimiento al ciclo de investigación doctoral, brindando información oportuna y de calidad para la toma de decisiones a jefaturas de programa, equipos de gestión, autoridades locales y centrales de la universidad. Disponible 24/7 desde cualquier lugar del mundo, es la primera plataforma interconectada con los diferentes sistemas centrales de la UC a través del data warehouse (sistema de almacenamiento) institucional. La plataforma SaGA cuenta con módulos que ya están operativos y que permiten gestionar y coordinar las actividades concernientes a cada etapa del ciclo de investigación del doctorado: candidatura y las actividades anuales de seguimiento. En agosto de este año se habilitará además el módulo de defensa de tesis. Además, el sistema promueve el uso de las herramientas del programa de apoyo a la dirección de tesis, las cuales estarán disponibles durante todo el ciclo de investigación para apoyar el fortalecimiento de la relación entre estudiantes y directores de tesis.\n\nDiego Cosmelli, director de la Escuela de Graduados destaca que “SaGA facilita la gestión y seguimiento a estudiantes en ciclo de investigación de la UC, optimizando los tiempos y cargas de trabajo que son tan valiosos en este ciclo formativo. Al mismo tiempo nos permitirá contar con datos e información clave para los procesos de acreditación de los programas de doctorado lo que impacta positivamente en la imagen y prestigio de la UC, incluso a nivel internacional”.\n\n\"SaGA nos permitirá contar con datos e información clave para los procesos de acreditación de los programas de doctorado lo que impacta positivamente en la imagen y prestigio de la UC\"- Diego Cosmelli, director de la Escuela de Graduados UC. En el desarrollo de la plataforma participó la Dirección de Transformación Digital, unidad que está impulsando la adopción de tecnologías al interior de la UC para favorecer la gestión institucional. “Uno de los avances en la transformación digital UC, se expresa con SaGA, sistema que tecnologiza procesos de alta especificidad, como lo son las herramientas para la gestión y acompañamiento de la tesis doctoral, en un ambiente amigable, se puede contar hoy con información actualizada y en un formato común y transversal a todas las unidades académicas de la UC”, sostiene Mauricio Bernabó, director de Transformación Digital. \n\n“Uno de los avances en la transformación digital UC, se expresa con SaGA, sistema que tecnologiza procesos de alta especificidad\" - Mauricio Bernabó, director de Transformación Digital. Estudiantes, académicos, jefaturas de programas, equipos de gestión y autoridades pueden ingresar a conocer SaGA en este enlace y aprovechar sus beneficios en el desarrollo de la tesis doctoral."
  },
  {
    "university": "Pontificia Universidad Catolica de Chile",
    "country": "Chile",
    "title": "UC innova en educación continua con nuevo sistema digital de gestión",
    "content": "Enmarcado en el proceso de transformación digital, el Sistema Integrado de Gestión de la Educación Continua (SIGEC) consolida el liderazgo regional de la universidad, que en 2021 contó con más de 122 mil alumnos matriculados. Un importante hito cumplió hace algunos días el Sistema Integrado de Gestión de la Educación Continua (SIGEC) que está impulsando la Universidad Católica: la incorporación de un nuevo módulo digital para la gestión comercial y financiera de los diplomados y cursos de todas las facultades de la institución. Quienes estudian en la UC podrán ahora ingresar de manera expedita a sus cursos, correos electrónicos, certificaciones, evaluaciones, procesos de pago y matrícula, por lo cual su experiencia formativa se verá beneficiada.\n\nSe trata de una iniciativa enmarcada en el proceso de transformación digital de la UC, que es liderada por la Prorrectoría de Gestión Institucional, la Dirección de Educación Continua, en colaboración con facultades, docentes y otras unidades, como la Dirección de Informática, Dirección de Transformación Digital y Dirección Digital. \n\n\"SIGEC es un gran ecosistema de plataformas digitales que se integran automáticamente para toda la gestión de la educación continua, que involucra todo el proceso de vida del alumno: desde la difusión de los programas, la postulación y matrícula, la gestión académica, los procesos financieros, la impartición de los cursos en plataformas virtuales, la certificación, entre otros\", explica Luz Montero, directora de Educación Continua.\n\n\"SIGEC es un gran ecosistema de plataformas digitales que se integran automáticamente para toda la gestión de la educación continua, que involucra todo el proceso de vida del alumno\" - Luz Montero, directora de Educación Continua La iniciativa que comenzó a idearse en 2017, bajo el impulso de las autoridades de esa época -como Paulina Gómez, ex vicerrectora de Comunicaciones, y de Margarita Guarello, anterior directora de Educación Continua- implicará que el servicio será totalmente digital y rápido, lo cual ayudar no solo a mejorar su calidad, sino que también a internacionalizar la oferta académica de la UC.\n\nActualmente, más del 90% de los cursos que se ofrecen son online, por lo cual cada vez es más relevante que los sistemas y procesos sean digitales.\n\nDurante el 2019 se había puesto en marcha la fase 1 del proyecto, con la implementación de un sistema de certificación electrónica con firma digital avanzada. La segunda etapa, completada recientemente, incluye, además del módulo de administración comercial, también un sitio web actualizado y nuevos portales de inscripción y matrículas, que estarán integrados con Salesforce, un software de clase mundial para la gestión comercial. \n\nA través de un sistema altamente integrado y digital, la plataforma permite potenciar aspectos claves y estratégicos de la educación continua, como perfeccionar y aumentar la oferta académica, potenciar el crecimiento, variedad y competitividad de los programas. También se logra mejorar el posicionamiento de la oferta, consolidar la organización y las capacidades internas en este ámbito, y disponer de la infraestructura, tecnologías e inversiones para robustecerla y proyectarla en el largo plazo.\n\nPatricio Donoso, prorrector de Gestión Institucional, puntualiza que la implementación de SIGEC busca lograr una experiencia más dinámica, clara y oportuna por parte de los alumnos, que son el principal foco de esta transformación digital. Agrega que para esto “debemos acelerar un cambio cultural al que todos estamos llamados a involucrarnos y adaptarnos, fortaleciendo así nuestras propias capacidades de trabajo”.\n\n“Debemos acelerar un cambio cultural al que todos estamos llamados a involucrarnos y adaptarnos, fortaleciendo así nuestras propias capacidades de trabajo” - Patricio Donoso, Prorrector de Gestión Institucional Estos cambios se enmarcan en el contexto de un gran crecimiento que ha experimentado la educación continua en la UC. Durante el 2021 se matricularon más de 122.000 estudiantes, muchos de los cuales, además, provienen de diversas regiones de Chile y de otros lugares del mundo. El incremento es relevante si se considera que en 2019 eran poco más 80 mil alumnos.\n\nLa transformación sigue en marcha\nA partir de la implementación de la fase 2 de SIGEC, tanto los equipos que han participado directamente en la operación de estos nuevos sistemas como las unidades académicas de la universidad han fortalecido su colaboración para cumplir con los nuevos estándares de gestión. \n\n“Estamos muy contentos de haber alcanzado este logro, tras años de ardua labor. Sabemos que debemos seguir trabajando intensamente en este período de estabilización de los sistemas, con miras a la próxima implementación del módulo académico”, señala la directora de Educación Continua, Luz Montero. Recalca que “la transformación de la educación continua no termina con este proyecto, necesitamos un trabajo convocante, alineado y con visión de futuro”. “Al estar todos estos elementos integrados, que se apoyan mutuamente permitirá responder con mayor eficiencia a las necesidades de los alumnos\" - Paulina Rodríguez, directora del proyecto SIGEC ¿Cuáles son los próximos pasos? La directora del proyecto Paulina Rodríguez, explica que durante el 2023 será el turno de la implementación del módulo académico, que incorporará al ecosistema a Banner, un software de registros académicos, y la plataforma Moodle como sistema de gestión de aprendizaje. “Al estar todos estos elementos integrados, que se apoyan mutuamente permitirá responder con mayor eficiencia a las necesidades de los alumnos."
  },
  {
    "university": "Pontificia Universidad Catolica de Chile",
    "country": "Chile",
    "title": "Una estrategia nacional para la ciberseguridad en Chile",
    "content": "Un comité de expertos del mundo público, privado y de la academia, desarrollarán la “Hoja de Ruta de Ciberseguridad”, un plan concreto liderado por el Centro de Innovación UC y Microsoft, para robustecer la seguridad digital de Chile en un plazo de tres años. El cibercrimen es una problemática que afecta a diversos sectores de la sociedad. Así queda evidenciado en el estudio “Impacto de COVID-19 en la cultura y operación de las Pymes chilenas”, de Microsoft Chile, que evidenció que 9 de cada 10 empresas declaró que la pandemia aceleró la transformación digital de su negocio por medio de la adopción tecnológica, indicando que un 93% de ellas invirtió para facilitar el teletrabajo. Sin embargo, de acuerdo a la revista Forbes, las pequeñas empresas fueron tres veces más susceptibles que las compañías de mayor tamaño a ataques cibercriminales, como hackeos, amenazas cibernéticas y phishing, entre otros.\n\nLa ciberseguridad es una necesidad transversal y progresiva, debido al exponencial aumento de delitos ligados al cibercrimen y la alta tasa de intentos de ciberataques a entidades público-privadas y, por sobre todo, a la sociedad civil.\n\nSegún datos entregados por el estudio “Cyber Signals” de Microsoft, solo en diciembre de 2021 se registraron a nivel global 83 millones de ataques cibernéticos, mientras que más de 9,6 billones de amenazas fueron reportadas por parte de dispositivos de empresas y consumidores, bloqueando más de 35 billones de cuentas maliciosas de e-mail dirigidos a clientes y consumidores.\n\nLa seguridad digital también es una necesidad urgente en el país. De ahí que naciera la “Hoja de Ruta de Ciberseguridad”, una iniciativa liderada por el Centro de Innovación UC Anacleto Angelini y Microsoft Chile y que nació de un plan anterior, la “Hoja de ruta de transformación digital para la reactivación económica”. El objetivo es desarrollar un plan de acción concreto para ser ejecutado en los próximos tres años.\n\nLa iniciativa, que reúne a expertos del mundo público, privado y académico, de diversas áreas e industrias, busca contribuir en el diagnóstico e impactar en el desarrollo de propuestas que permitan a Chile hacer frente a las inmensas brechas de ciberseguridad a las que nos encontramos expuestos.\n\nPara Pedro Bouchon, vicerrector de Investigación UC y presidente del consejo directivo del Centro de Innovación UC, esta hoja de ruta surge en el contexto de la necesidad de acelerar la transformación digital en el país, para ayudar a la reactivación económica. \"Esta transformación, sin embargo, no puede realizarse de forma desprotegida, dado que la digitalización abre espacios importantes de vulnerabilidad sobre los cuales deben construirse capacidades críticas de prevención, mitigación y resiliencia cibernética en el ecosistema”, manifiesta.\n\nY añade: “La velocidad de los ataques de ciberseguridad y la constante evolución y sofisticación del cibercrimen, hace necesario el desarrollo de modelos de colaboración Universidad-Industria-Estado, que sean capaces de empujar la investigación de frontera, y faciliten la transferencia tecnológica y el conocimiento de forma ágil. Es aquí donde la hoja de ruta tiene un rol fundamental para facilitar el desarrollo de espacios de experimentación y pruebas de concepto asociativas, que permitan contar con laboratorios de ciberseguridad para el desarrollo de investigación avanzada, y formación de competencias y talento”. Nuevas competencias para enfrentar los ciberataques “Un eje crítico para el desarrollo de una hoja de ruta es el desarrollo de talento y competencias”, expresa Mario Ponce, decano de Facultad de Matemáticas, integrante del comité asesor y del comité del desarrollo de talento de la \"Hoja de Ruta de Ciberseguridad\".\n\nEn esta línea, se proyectan brechas importantes de talento especializado necesario para enfrentar los desafíos de ciberseguridad de los próximos años, lo que significa un desafío no solo en las organizaciones que demandan este tipo de perfiles y que deben generar nuevos modelos de atracción y retención de talento, sino que también, como dice el decano Ponce, “para nosotros como universidad, respecto a cómo generamos nuevos modelos de formación que se adapten a estas demandas de talento”.\n\nDe acuerdo al decano, “nuestros desafíos están en torno a qué nuevos perfiles, competencias, metodologías y modalidades necesitamos crear y ofrecer; considerando estos desafíos de manera transversal, tanto frente a estudiantes de pre y postgrado, como educación continua a profesionales, e incluso, el trabajo a nivel escolar”. Y añade que “algunas de estas líneas las hemos abordado por medio de la creación de nuevas licenciaturas y nuevos programas de educación continua, y a nivel escolar a través de las olimpiadas de matemáticas, que se proyectan como un espacio de detección de talento importante. Sin embargo, aún hay espacios de oportunidad para desarrollar modelos de formación junto con la industria y con mayor agilidad para responder a las demandas del ecosistema”.\n\nMetodología de trabajo\n“En estos casi tres meses de trabajo junto con el comité asesor, ya desarrollamos la primera etapa que correspondía a un diagnóstico compartido con brechas y oportunidades en ciberseguridad. En este proceso fue muy relevante entender qué experiencias comparadas existen y qué iniciativas se están ejecutando en el ecosistema local y regional”, explica Rocío Ortiz, coordinadora I+D en el área de transformación digital y ciberseguridad, del Centro de Innovación UC.\n\n“Sobre ese diagnóstico compartido se realizó una priorización y se seleccionaron tres áreas estratégicas que dieron origen a los comités de desarrollo”, explica la responsable de la metodología de trabajo de la \"Hoja de Ruta para la Ciberseguridad\".\n\nEl comité asesor es liderado por María Francisca Yáñez, directora de Innovación y Tecnología de Microsoft Chile, y Ramón Molina, director ejecutivo del Centro de Innovación UC, en calidad de chair o directora y co-chair o codirector, respectivamente. Además de un destacado grupo de líderes y expertos de diversas áreas, que estará encargado de elaborar propuestas de trabajo desde los distintos comités de desarrollo (tecnológico, de talento y de cultura de ciberseguridad). El trabajo culminará con la publicación de un documento, de dominio público, que buscará generar una contribución e impacto social. Los desafíos de la \"Hoja de Ruta para la Ciberseguridad\"\n“Los próximos desafíos serán construir los portafolios de proyectos que se necesitan ejecutar durante los próximos tres años, para poder alcanzar la visión de futuro que esperamos en torno a ciberseguridad para Chile, definiendo una línea de trabajo táctica y asociativa para ejecutarla”, comenta Rocío Ortiz.\n\nComo cuenta Ramón Molina, “una de las primeras conclusiones a las que se llegó en esta primera etapa, luego del levantamiento, es que ya existe un diagnóstico estratégico asociado a cuáles son las brechas y oportunidades de ciberseguridad para Chile, así como también, indicadores de nuestro nivel nacional de madurez en esta temática”.\n\nPor lo tanto, “el rol que tiene esta hoja de ruta es realizar una bajada táctica y concreta del plan de acción que nuestro país necesita para alcanzar el nivel de madurez deseado. En esta línea, la innovación es la base fundamental para poder desarrollar modelos de trabajos colaborativos y óptimos para movernos con el nivel de agilidad que necesitamos”, añade Molina.\n\nLos tres comités de desarrollo que ya iniciaron su labor, tras la priorización estratégica implementada, son: “Talento y desarrollo de competencias en ciberseguridad”, “Cultura en ciberseguridad” y “Tecnología, ecosistemas, protocolos y estándares para la ciberseguridad”. Estas mesas reúnen a más de 60 expertos, técnicos y especialistas de diversas áreas e industrias, quienes estarán trabajando durante los próximos dos meses.\n\nUna vez consolidado el portafolio de proyectos propuestos por estos comités, el consejo asesor los revisará y evaluará, para definir cuáles serán las medidas consideradas finalmente en el documento oficial de la \"Hoja de Ruta de Ciberseguridad\"."
  }
]