[
{"university": "University of Oxford", "country": "United Kingdom", "title": "Oxford’s digital transformation", "content": "             We will enable Oxford to continue advancing learning by teaching and research, and preserve its unique place in the world by being digitally fit for the future.  This evolution is about making it possible for students and staff in all roles at Oxford to realise their fullest potential with new digital experiences that are good for people and planet.  Over the next few years, we will partner with leaders and their teams across the collegiate University alongside external experts to introduce appropriately paced and carefully coordinated changes that meet both central and local needs.  Digital transformation is not just about updating IT systems and introducing some new apps. A true digital transformation will take years and will depend on a cultural shift across the entire collegiate Oxford. It will create opportunities for all of us to reimagine how we do things and how we work with each other.                The list was updated About Digital Transformation About Digital Transformation Find out why Oxford must transform and the key areas of focus for the Digital Transformation Programme Our approach Our approach Learn how Oxford's Digital Transformation Programme will deliver changes across the University Phase 1: The foundation phase Phase 1: The foundation phase The story so far... find out about the first 18 months of Oxford's Digital Transformation Phase 2 initiatives Phase 2 initiatives A list of the initiatives that are part of Phase 2 Speak to the team Speak to the team The senior members of Oxford's Digital Transformation Programme Requires login: Sign-up to Oxford's Digital Digest Sign-up to Oxford's Digital Digest Sign-up to the Digital Digest and view all editions                   Latest News    The list was updated Workflow and Automation Competency Centre streamlines VC Awards entry process Workflow and Automation Competency Centre streamlines VC Awards entry process Workflow and Automation Competency Centre streamlines VC Awards entry process 2 May 2024 Working on Oxford's Digital Transformation: Emma Hatfield, Senior Business Analyst Working on Oxford's Digital Transformation: Emma Hatfield, Senior Business Analyst Working on Oxford's Digital Transformation: Emma Hatfield, Senior Business Analyst 24 April 2024 TMS (Teaching Management System) pilot squad starts sprinting TMS (Teaching Management System) pilot squad starts sprinting TMS (Teaching Management System) pilot squad starts sprinting 23 April 2024 Preparing for our digital leap Hear from Natasha Preparing for our digital leap Preparing for our digital leap Natasha Heaton talks about the  new possibilities for students, teaching staff, researchers and professional services... Natasha Heaton talks about the  new possibilities for students, teaching staff, researchers and professional services teams as Oxford becomes digitally fit for the future Natasha Heaton talks about the  new possibilities for students, teaching staff, researchers and professional services teams as Oxford becomes digitally fit for the future Natasha Heaton talks about the  new possibilities for students, teaching staff, researchers and professional services teams as Oxford becomes digitally fit for the future 18 March 2024 1 2 3 … 6 next last                   Competency Centres    The list was updated Competency Centres Competency Centres Cyber Security Competency Centre Cyber Security Competency Centre Workflow and Automation Competency Centre Workflow and Automation Competency Centre Cloud Computing for Research AI and ML Competency Centre Cloud Computing for Research AI and ML Competency Centre AI and Machine Learning Support Competency Centre AI and Machine Learning Support Competency Centre                       The list was updated Oxford Digital Festival Oxford Digital Festival Oxford Digital Festival Relive the first Oxford Digital Festival Digital Oxford Podcast Digital Oxford Podcast Digital Oxford Podcast Listen to the latest episode of Digital Oxford a Podcast hosted by Professor Anne Trefethen                 Learn more about digital changes at Oxford          "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "About Digital Transformation", "content": "             Our ambition​  Together, we are imagining how Oxford University’s culture, processes, and technology must evolve in the digital era. ​  Making it possible for students and staff in all roles at Oxford to realise their fullest potential with new digital experiences that are good for people and planet. ​      Why transform?  The ability to innovate and transform with the changing ages is a timeless strength in Oxford’s story.  That’s one of the reasons our institution has been growing strong for nine centuries. Today, we are continuing to differentiate, create ground-breaking outcomes, and grow in our ever-changing world.  Our systems must be simple, secure, and innovative . Across collegiate Oxford, we must have robust and connected digital underpinnings for our ambitions to be fully realised.  That’s why the Digital Transformation programme is a timely and strategic next step in Oxford’s evolution. It is about equipping our academics, researchers, and their collaborators with the highest-quality digital experience and capabilities so they can compete in the international research environment and continue to deliver world-leading innovation and discoveries. It is also about modernising the student experience with easy-to-use, reliable, and joined-up technology.  Focus areas  The programme is focusing on:   New possibilities Innovating to advance teaching and research, and its dissemination by digital means.  Enriching experiences Enhancing staff, student, public, and collaborator experiences in a hybrid world.  Global impact Meeting our civic duty, not only locally and regionally, but globally and for our planet.  Simplicity Simplifying processes and systems to save time, minimise effort, and reduce burden from workarounds and unconnected data and technologies.  Growth opportunities Exploring new business models to increase revenue through online education, engagement and commercial activities.                            Contact us   Send us an email at digital.transformation@admin.ox.ac.uk               Popular links    Foundation phase  List of i nvestigative assignments   Competency Centres     Plan on a page phase1.pdf    Plan on a page phase1.pdf       Plan on a page phase2.pdf    Plan on a page phase2.pdf                      "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Workflow and Automation Competency Centre streamlines VC Awards entry process", "content": "                 2 May 2024                           The Workflow and Automation Competency Centre helps departments, divisions and project teams implement new tools and processes to make their work easier and more efficient, empowering digital transformation.  Newly combined awards  This year the Vice-Chancellor's Awards moved from five separate sets of awards to a single celebration of the University’s people. This meant the awards teams needed to develop a single way of managing nominations across the 11 combined categories.  The awards team worked with the Centre to develop a completely new process for submitting, managing entries, and communicating to nominees, regardless of the award category.  Handling complexity  The awards entry process involves specific considerations and requirements, with several ways to submit entries and individuals potentially being nominated for multiple awards. The scope of the awards means there is a vast amount of data to be managed, organised, and securely stored, and a large volume of personalised communication is required.  The Competency Centre’s business technologists and technical experts analysed the awards team’s needs and helped implement new systems to automate previously admin heavy tasks. It provided consultation, training, and support to streamline processes, freeing up time and replacing manual processes with simple, technology driven ones.  Dan Selinger, Head of Communications and Engagement for Professional Services, and Co-Chair of the Awards Working Group said:  “Working with the Competency Centre was a breath of fresh air. We had a complex set of requirements for an ambitious and high-profile project. The experts in the centre were great at understanding our needs, working with us to find the right solution, iterating it over time and supporting those of us with limited technical expertise to put it into practice.”   Automated processes  Entries are now automatically stored into relevant SharePoint folders for judges to review, improving the process and reducing opportunities for human error. No automation is used to grade or influence the award outcomes, or replace important human judgement, but it has streamlined the admin work required to get the right entries to the right judges as efficiently as possible.  Other processes have been implemented to automate personal emails notifying individuals on their nominations and if they were successful or not. Over 1,500 emails were sent covering around 250 nominations, reducing the admin burden, saving time, and making communication timelier and more efficient.  Continuous improvement  Rather than simply implementing a one-time solution, the centre focused on working closely with the awards team to ensure they had the skills and training needed to implement and use these systems in the future.  An evaluation and after-action review is due to take place at the end of this year’s awards, and the learnings will feed into enhancing processes in future years.  Competency Centres, being introduced as part of Oxford’s digital transformation journey, are helping to transform the way that a department or project team uses a key area of existing or emerging digital technology. There are other current Competency Centres focused on cybersecurity and research computing. Alongside these, two new centres are being introduced in 2024, including AI and Machine Learning Support and Immersive Technologies.    For more information or to work with a competency centre please visit Competency Centres | Staff Gateway (ox.ac.uk)                     Share this             Share on facebook Share on twitter Share via email             More news                The list was updated 12 student focus groups have taken place during Hilary term 12 student focus groups have taken place during Hilary term Competency Centres Competency Centres Cybersecurity training is underway Cybersecurity training is underway 11 September 2023 1 2 3 … 8 next last                  Back to all Digital Transformation news         "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Working on Oxford's Digital Transformation: Emma Hatfield, Senior Business Analyst", "content": "                 24 April 2024                         Working on Oxford's Digital Transformation: Senior Business Analyst      We've started a new blog series called 'Working on Oxford's Digital Transformation', where we ask colleagues who are enabling or delivering Oxford's Digital Transformation three questions on their past, their present and the their hopes for Oxford's digital future.  This month we caught up with Emma Hatfield a Senior Business Analyst on the programme. Continue reading to learn how Emma is supporting Oxford's Digital Transformation.  What led you to join Oxford?  My career has taken me in different directions but I seem to keep coming back to working with people and technology. I have touched on different sectors and different job roles from IT training for a privately owned company, to local government (including work on a continuous change programme) via a stint in staff development at the University of Surrey. A brief (very brief) return to teaching (I originally trained as a teacher) followed and since then I have worked at Oxford University for over 15 years starting at the Careers Service and then moving to IT Services starting as a Junior Business Analyst.  Can you describe what a normal week working on Oxford's digital transformation is like?   I’m not sure there is such a thing as a normal week as it all depends what the priorities are and what the team is involved in from week to week. There are some consistents: Daily Scrums, Sprint Planning and Sprint Retrospectives, also team meetings. At the moment we have a focus on supporting the teams in the Education Portfolio who are piloting the new delivery approach (squads using an agile approach). I also get involved wherever my analysis skills are of use, so for example, recently I was doing some spreadsheet work to help inform preparation work for the case of support for the Digital Transformation Programme for the next two years. We are also continuing to look at progressing Digital Services and Products .  What are your hopes for Oxford's Digital Future?  I imagine that Oxford will be making the most of opportunities to continue the never ending digital transformation journey, innovating and levering digital means to enhance teaching, research and knowledge dissemination. Hopefully with the user (staff, students, the public and collaborators) at the heart of things and using data and information as appropriate to inform decisions and progress.                      Share this             Share on facebook Share on twitter Share via email             More news                The list was updated 12 student focus groups have taken place during Hilary term 12 student focus groups have taken place during Hilary term Competency Centres Competency Centres Cybersecurity training is underway Cybersecurity training is underway 11 September 2023 1 2 3 … 8 next last                  Back to all Digital Transformation news         "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Speak to the team ", "content": "          Who is involved with Oxford's digital transformation?  The Information and Digital Committee acts as the programme board for Digital Transformation.   Senior Responsible Officer (SRO): Professor Anne Trefethen, Pro-Vice-Chancellor, People & Digital  Programme Director: Natasha Heaton  Programme Manager: Cathy Farrow  Programme Business Change Manager: Heidi Hunt  Head of Competency Centres: Alwyn Collinson  Communications Manager: Ejaz Khan   The Digital Transformation Delivery Group members include: Anne Trefethen, Natasha Heaton, Sean Duffy, Stuart Lee, Ian Teasdale, Heidi Hunt, Cathy Farrow, Dave Smith, Ejaz Khan.  In addition, we will continue to engage with the relevant Committees of Council and when appropriate, Conference of Colleges to provide regular updates and seek their input in decisions.  As part of our ongoing work, we are working directly with various colleagues in divisions, departments, and central function teams to ensure that our interventions, investigative work and competency centres will reflect their perspectives and needs.  We also communicate news and updates via the Digital Transformation newsletter, Digital Digest , as well as UAS and divisional communication channels such as the AAD news alert .                    HOMEPAGE               Contact us   Send us an email at digital.transformation@admin.ox.ac.uk                         "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Our approach", "content": "          Principles for change  At the heart of digital transformation, we have four principles for how we will design new outcomes and four for how we will deliver changes. These principles are embedded in the governance and delivery of the programme, and in some sense form a contract for change:  Our design principles:   User need and business need  Security and privacy  Environmental sustainability  Efficiency through simplification and adoption of standards   Our delivery principles:   Agility - Able to adapt quickly to changing needs and environment  Partnership - Collaborating across the institution, and with external partners  Pace - Moving as quickly as we can and as slowly as we must  Subsidiarity - Allowing delivery and innovation at the most appropriate level of the organisation   Our considerations  We are constantly considering these questions with colleagues and students to make sure this transformation can best serve the needs of everyone across the collegiate University:      People - How can we be digitally confident to innovate individually and together?  Planet - How can we deliver outcomes that are good for the planet as well as people?  Culture - How can we devote ourselves to making Oxford digitally fit for the future?  Process - How can we continuously reimagine the way we work?  Data - How can we trust data to make informed decisions?  Technology - How can we use technology to simplify and make things easier for everyone?                                     Contact us   Email the team at digital.transformation@admin.ox.ac.uk               Related links    Oxford’s digital transformation themes  Digital transformation foundation phase                    "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Phase 2 initiatives", "content": "                           The list was updated Technology Portfolio initiatives Technology Portfolio initiatives Education Portfolio initiatives Education Portfolio initiatives Engagement and Dissemination Portfolio initiatives Engagement and Dissemination Portfolio initiatives Administration Portfolio initiatives Administration Portfolio initiatives Research Portfolio initiatives Research Portfolio initiatives Information & Digital Governance Committee initiatives Information & Digital Governance Committee initiatives                             Contact us   Speak to a member of the Digital Transformation team at digital.transformation@admin.ox.ac.uk                         "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Phase 1: The foundation phase ", "content": "          In July 2022, University Council agreed to fund the Foundations for Digital Transformation programme . Our bid was successful thanks to the involvement and ideas from many colleagues and students during an extensive scoping stage in which we analysed and assessed University needs.  It became clear from conversations with colleagues and students that before the University can develop more ambitious digital solutions in the future, we need to put in place some of the building blocks and fix some issues with existing systems. So, our first phase is about strengthening our foundations.  Over the next eighteen months, colleagues and students should see improvements in Oxford’s digital services. These could include, expansion of digital assessment in the Exam Schools, and improvements in some of our key administrative systems for academics, researchers and administrators. Although these initial changes will not be entirely transformative, they will make life easier across collegiate Oxford.  As we facilitate the changes, the programme team is also engaging global technology firms, consultants, and advisory partners to seek insights on how other organisations are making similar step changes.  You can read more about the programme in our business case for digital foundations (SSO required).                Interventions    Investigative assignments    Competency Centres    Creating the conditions for success    Dialogue with stakeholders       Interventions              Delivering key initiatives that will address urgent needs or lay the foundations for future transformational changes, eg connectivity and accessibility.  These interventions will resolve issues with our existing systems and processes, improve student and staff experience, reduce risk and allow greater compliance, reduce paper-based processes, improve data quality, grow our capability in cybersecurity, and start to simplify life for departments.                The list was updated Interventions Interventions Interventions                Investigative assignments              Analysing and testing less well-understood ideas to recommend the options and steps the University could consider to develop the appropriate solutions - particularly, any funding we may need to request for the next phase.  An example of an investigation is ‘Future proofing Wi-Fi’ to enable future network design and planning around Wi-Fi. Another example is the creation of a student hub, an app to bring together all student-related services in one place.  You can view the complete list of investigative assignments taking place.                The list was updated Investigative assignments: What you need to know... Investigative assignments: What you need to know... Investigative assignments: What you need to know... Investigative assignments Investigative assignments Investigative assignments Investigative assignments are now concluding Investigative assignments are now concluding Investigative assignments are now concluding Requires login: Investigative assignment outcomes Requires login: Investigative assignment outcomes Investigative assignment outcomes                Competency Centres              Introducing Oxford’s new hubs of digital expertise across different parts of the University. These centres – a new concept for Oxford – will share key capabilities and enable colleagues across Oxford to create change in the future.  There will be immediate impact on the use of our existing systems and increased know-how and capability across the institution. We are currently have centres for Cybersecurity , Research Cloud and AI/ML Computing Competency Centre and Workflow and Automation .  You can learn more about Competency Centres on their individual webpages and on SharePoint.                The list was updated Competency Centres Competency Centres Competency Centres Cyber Security Competency Centre Cyber Security Competency Centre Cyber Security Competency Centre Workflow and Automation Competency Centre Workflow and Automation Competency Centre Workflow and Automation Competency Centre Cloud Computing for Research AI and ML Competency Centre Cloud Computing for Research AI and ML Competency Centre Cloud Computing for Research AI and ML Competency Centre                Creating the conditions for success              The Foundation phase is also facilitating strategic reviews exploring how the University can best fund, govern, and deliver digital experiences, services and technology in the future.  More information on the outcomes of these reviews will be communicated during 2023.              Dialogue with stakeholders              Throughout the Foundation phase and beyond, we will continue to engage academics, researchers and other colleagues, alongside students, global technology firms, management consultants and peers in higher education to develop our thinking and approach.  Get Involved  Oxford’s Digital Transformation can only be successful if our work reflects the richness of life and work all across the University. That's why we are continuously seeking views, ideas, and questions from staff and students. Please do get involved and help shape Oxford's exciting digital future. Let's talk.  Email us at digital.transformation@admin.ox.ac.uk                                         Contact us   EMAIL US                 What are we working on as part of the foundation phase?   Please contact digital.transformation@admin.ox.ac.uk for accessible versions of PDF's   Interventions (Annex 1) (SSO required)  Business case for Digital Foundation phase (SSO required)  Building for a digital future   We're all transforming                 Related links      Plan on a page phase1.pdf    Plan on a page phase1.pdf     Interventions   List of Investigative assignments   Competency Centres                   "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "TMS (Teaching Management System) pilot squad starts sprinting", "content": "                 23 April 2024                           As part of the University’s Digital Transformation programme, four pilot projects are underway to test and implement Agile methodology to improve key systems within the Education Portfolio, starting with TMS (Teaching Management System).  The team (referred to as a squad in the Agile context) improving TMS have reached an important milestone in the pilot and have begun the sprinting phase. This means they are now planning, collaborating, executing and evaluating in two-week sprints to deliver continuous improvements to TMS. A sprint is a time-boxed period - in our case two weeks - when a squad works to complete a set amount of work.  The TMS squad is made up of colleagues from existing teams and expert consultants supporting the implementation of Agile. They are trialling new ways of working with a focus on user feedback around what is needed from the system.  What is TMS?  TMS is a digital application used by academic and administrative staff involved in undergraduate teaching at colleges and departments across the University of Oxford. Its primary purpose is to administer tutorial reports and payments related to undergraduate tutorial teaching provided by or on behalf of colleges. The system was designed to streamline teaching-related processes and make it easier for educators to manage their teaching responsibilities.  TMS is used across the collegiate University meaning users have a wide range of needs. It was built internally in 2020/21 and launched during the pandemic, and was then handed over to be supported, rather than developed further. As TMS has been used, issues have been identified around user interface and user experience, but there has been no team available to make major improvements to the system over and above standard support issues.  What is the TMS squad working on?  As part of Oxford’s digital transformation programme, a decision was made to prioritise TMS and ensure it was one of the first systems being continuously improved with new investment and resources. Following a successful mobilisation and discovery phase, the squad will focus on making ongoing improvements to TMS which will be implemented, tested and launched in regular two-week sprints into the live environment. This means users will start to experience improved user experience on a regular basis during the next few months.  The TMS squad are working closely with student and staff colleagues throughout the project to ensure the views and needs of end-users are reflected in the service improvements. Ongoing updates within the Agile methodology means the team can continuously test improvements and get feedback from users to refine and implement further changes.  User interface and user experience have been identified as key priorities for TMS during the discovery phase. The team have already made background updates to the technical architecture of the system and implemented a “select all” button to improve user experience. Previously, users had to manually select relevant options from a long list, but the new “select all” function allows them to quickly select a large number of options from the filter menu. These changes will be released to the live system in the next few weeks.  All product squads need the help of a Product Owner who knows the users’ needs and can help the team deliver the features that will best benefit them. If you are a TMS user with an interest in developing your stakeholder management and problem-solving skills and are keen to help improve TMS for its users, please consider applying for the new TMS Product Owner role .  The wider pilot programme  Alongside TMS, pilot programmes are also taking place with SITS (Student Information System), ADSS (Undergraduate Admissions) and Canvas (Virtual Learning Environment). The SITS and ADSS squads are currently in the discovery phase, while Canvas will mobilise in June, with all teams working closely with relevant user groups to identify key priorities for the teams. All pilot team members are receiving Agile training as part of their induction into the pilot before they start sprinting, TMS and SITS have completed theirs with ADSS and Canvas happening soon, to ensure they have recent agile knowledge and to help develop their agile awareness.                      Share this             Share on facebook Share on twitter Share via email             More news                The list was updated 12 student focus groups have taken place during Hilary term 12 student focus groups have taken place during Hilary term Competency Centres Competency Centres Cybersecurity training is underway Cybersecurity training is underway 11 September 2023 1 2 3 … 8 next last                  Back to all Digital Transformation news         "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Preparing for our digital leap", "content": "                 18 March 2024                         I am hugely motivated by the privilege of leading Oxford’s ambitious Digital Transformation programme. I am inspired by the power of colleagues collectively enabling Oxford to preserve its unique place in the world by being digitally fit for the future. In this blog, I’d like to reflect on how our efforts so far are enabling Oxford to start taking a digital leap.  Digital transformation is an evolution. It’s not a single short-term programme. It involves thousands of people collaborating on hundreds of initiatives, continuously over time, to transform our inner workings and create simpler, connected and modernised experiences for staff and students.  It's remarkable to think how much Oxford has already evolved in just the last few months. We now have a new Information and Digital Committee (IDC), replacing the previous IT Committee, and five new digital portfolio committees where leaders from across the collegiate University carefully decide which digital initiatives we must invest in to strengthen Oxford’s impact in education, research, administration, dissemination and engagement and technology. They apply six-dimensional thinking: people, planet, culture, process, data and technology to make sure the initiatives are not just focusing on the digital part alone. As we often say, digital transformation is less about the digital and more about the transformation.  We are delivering changes using agile methodology to ensure our systems continuously reflect the fast-changing needs, views and practicalities for staff and students. These changes are beginning with education-focused pilot projects, including TMS (Teaching Management System), SITS (Student Information System), Canvas (Virtual Learning Environment) and ADSS (Admissions Decision Support System). Huge kudos to the team for getting these pilots up and running quickly. The pilot team will learn from this new approach and will create a blueprint for similar squads (agile delivery teams) in other digital portfolios.  Simplification is at the heart of our work; here are a few examples:   The new Student Hub will provide a simple consolidated point of entry for students to effectively navigate their relevant University and college systems and services and view key information.  Our new stable, secure and flexible web platform for all the University’s public-facing web content will enable every area of the University to publish easily and securely, with a flexible set of tools. Replacing existing solutions such as Oxweb and Mosaic, the new web platform will create rich digital experiences for hundreds of creators across Oxford.  Our new intranet will provide a simple digital experience for all staff bringing together content published across the University into a joined-up view. This will be underpinned by enhanced staff data allowing information to be targeted to those in specific roles.  The Digital Transformation team is currently assessing how we can simplify digital solutions for HR and finance colleagues – more news to follow over the coming months.   What else is going on with Digital Transformation?  I love telling colleagues about Oxford’s new competency centres . We now have in-house teams of top-notch experts available to show, help and train colleagues in using existing and emerging technologies. In addition to our current centres for Cybersecurity, Workflow & Automation and Research Cloud, we are now also creating new centres for AI and Machine Learning and for Immersive Technology.  Other initiative teams – including research computing, improving wireless , accessibility, physical spaces, online exams, and exam timetabling, to name a few – are collaborating with colleagues to focus on simplification, security and human-centred design. And, of course, we are keeping students involved and engaged along the way, especially with Student Digital Voice , our new student engagement approach.  Our evolution also involves working with external consultants and delivery partners such as Microsoft, Amazon Web Services and Slalom – who help solidify our knowledge and achieve excellence in how staff can use new tools such as Microsoft’s Co-pilot.  Looking forward and taking a digital leap  An element of my role that I most enjoy is talking to colleagues across our collegiate University about what a digital transformation can mean for them. Just this month, I am working hand-in-hand with Focus, the Bodleian and the Professional Services Together team. I am also looking at success measures for culture change and supporting an enterprise service management investigative where 15 departments/functions and a college are being interviewed about future possibilities. These conversations mean we can share ideas and make digital transformation a reality and not just a programme.  It feels like we have shifted up a gear in our transformation journey. Every day, I’m energised by knowing that Digital Transformation people across Oxford are co‑creating a more connected university and preparing for our digital leap.   Links   For more information, browse the news and resources on the Digital Transformation webpage .  Listen to the Digital Oxford Podcast , where Professor Anne Trefethen and her guests explore how the University is evolving in the digital era.  If you’d like to share an idea or check anything, please email the team at digital.transformation@admin.ox.ac.uk .                     Share this             Share on facebook Share on twitter Share via email             More news                 The list was updated Announcing the winners of the Vice-Chancellor’s Awards 2024 Announcing the winners of the Vice-Chancellor’s Awards 2024 13 May 2024 Congratulations to the winners, highly commended and finalists of the University-wide celebration of our outstanding people The changing face of research support The changing face of research support 13 May 2024 Stephen Conway, Executive Director of Research Services, outlines the activities across the University to support Oxford’s researchers and their research in an increasingly complex and digital world. Exploring Oxford's GLAM sites Exploring Oxford's GLAM sites 9 May 2024 To celebrate International Museum Day, staff members from some of the GLAM institutions showcase the diverse range of things to see and do across the University's cultural sites                  BACK TO ALL NEWS                  "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Competency Centres", "content": "          What is a Competency Centre?  A team who you can consult for expert support in a key area of digital technology.  The current Competency Centres support cybersecurity, research cloud computing, workflow automation, AI and ML support and immersive technologies.  Based in different locations across the collegiate University, each competency centre will share expertise in new digital solutions through training, advice, and support for Oxford’s people: academics, professional services staff and relevant students. Each centre is made up of a small group of dedicated staff who will support you in growing your confidence and competence as the University moves though its digital transformation. They provide free training, free consultancy, and help your team to deploy new technologies.  How do they work?  The centres offer three different types of support: Show me, Help me and Skill me.   Show me - One of the centre’s experts will show you what is possible with software or infrastructure to which the University already has access  Help me - You can contact the team to get help finding solutions to a specific technical problem that you are facing, up to and including bespoke software development  Skill me - You can be enrolled onto existing training pathways to gain a new skill or take part in a dedicated development programme organised by the centre   You can contact any centre via the Competency Centres’ SharePoint site , for expert support in a key area of digital technology.  Why this approach?  Competency Centres are intended to transform the way that a department or project team uses a key area of digital technology.  Competency Centres have been designed to ensure that all of our colleagues across Oxford are ready for the University's digital future. Each centre is embedded in a different area of the collegiate University, to ensure they can work smoothly with front-line staff and focus on user needs.  This approach will contribute to career development, retention, and recruitment as well as improving the use of existing systems.  Which Competency Centres can I visit for support?  ​  The digital transformation programme has already introduced the Cybersecurity, Workflow and Automation, Research Cloud Computing and AI and ML support Centres.  We welcome expressions of interest from project teams or departments interested in developing their technological expertise in the following three areas. To find out more about the Competency Centres and to contact their leads, click on the boxes below.  We also have a dedicated SharePoint site (SSO required) where you will be able to access detailed resources and information on each centre.                         Cybersecurity Competency Centre           Cybersecurity Competency Centre    Cybersecurity Competency Centre              Workflow and Automation Competency Centre           Workflow and Automation Competency Centre    Workflow and Automation Competency Centre              Research Cloud Computing Competency Centre           Research Cloud Computing Competency Centre    Research Cloud Computing Competency Centre              AI and ML Competency Centre           AI and ML Competency Centre    AI and ML Competency Centre                            Contact us      Email:  Workflow and Automation Competency Centre   Research Cloud and AI/ML Computing Competency Centre  Cybersecurity Competency Centre  AI and Machine Learning Competency Centre                   Related links     Digital Transformation homepage   Cybersecurity Competency Centre  Workflow and Automation Competency Centre  Research Cloud and Computing Competency Centre  AI and Machine Learning Support Competency Centre                    "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Cyber Security Competency Centre", "content": "        Cyber Security Competency Centre      Do you want to help contribute to keeping your work and your colleagues safe? Do you want to improve your skills and gain formal training and certification in modern cybersecurity?  The Cyber Security Competency Centre can help. We can offer free consultation, staff training, and technical support to help protect your department, centre or project.             What is the Cyber Security Competency Centre?      Using various professional development paths to allow existing IT staff in departments, divisions, faculties, and colleges to become part of a distributed Competency Centre led by the Interim Chief Information Security Officer (CISO) Tony Brett.  The Cyber Security Competency Centre was started in February 2023 and its first cohort received their formal accreditation from the British Computer Society in April 2023.                  Meet the team                    Tony Brett       Interim Chief Information Security Officer (CISO), Information Security Office                    Alwyn Collinson       Head of Competency Centres, Digital Transformation                    Andy Hamilton       Cybersecurity Co-ordinator and IT Manager, Wycliffe College                    Kashif Mohammad       Head of Cybersecurity Operations, Information Security Office                    Isabelle Gourlay       Implementation Manager for Competency Centres, Digital Transformation               if (typeof swipers == 'undefined') {\n            // initialise our swipers array\n            var swipers = [];\n          }\n                      jQuery(document).ready(function() {\n              initializeSwiper4383456_1();\n            });\n                    function initializeSwiper4383456_1() {\n            var swiper4383456_1 = new Swiper('#swiper-container-4383456_1', {\n              preloadImages: true,\n              updateOnImagesReady: true,\n              keyboard: true,\n              a11y: true,\n              observer: true, \n              observeParents: true,\n\n              \n                              loop: false,\n              \n              \n                              pagination: {\n                  el: '#swiper-pagination-4383456_1',\n                  type: 'bullets',\n                  dynamicBullets: true,\n                  dynamicMainBullets: 12,\n                  clickable: true\n                },\n              \n                              slidesPerView: 3,\n                                spaceBetween: 16,\n                                breakpoints: {\n                  1400: {\n                                          spaceBetween: 16,\n                                      },\n                  1200: {\n                                          spaceBetween: 16,\n                                      },\n                  992: {\n                                          slidesPerView: 2,\n                                                              spaceBetween: 16,\n                                        },\n                  768: {\n                                          slidesPerView: 2,\n                      spaceBetween: 16,\n                                      },\n                  320: {\n                    slidesPerView: 1,\n                    spaceBetween: 8\n                  }\n                },\n              \n              \n            });\n            swiper4383456_1.on('paginationUpdate', function(swiper, paginationEl) {\n              let unselectedelements = paginationEl.getElementsByClassName(\"swiper-pagination-bullet-active-main\");\n              for(const el of unselectedelements) {\n                el.setAttribute('aria-pressed', false);\n              }\n              paginationEl.getElementsByClassName(\"swiper-pagination-bullet-active\")[0].setAttribute('aria-pressed', true);\n            });\n            if(swiper4383456_1.pagination) {\n              //have to force an update here to get aria-pressed set correctly.  For some reason the render event isn't emitting\n              swiper4383456_1.pagination.update(swiper4383456_1, swiper4383456_1.pagination.el);\n            }\n            // Pause button event listener.\n            jQuery(document).on('click keypress', '#listing-wrapper-4383456_1 .swiper-pause-button', function(e) {\n              if (e.which == 13 || e.which == 32 || e.type == 'click') {\n                // Switch classes to play button.\n                jQuery(this).addClass('swiper-play-button').removeClass('swiper-pause-button');\n                jQuery(this).attr('aria-pressed', true);\n                jQuery(this).attr('aria-label', 'Start Automatic  carousel');\n                jQuery(this).find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/play_icon_dark.svg');\n                jQuery(this).find('img').attr('alt', 'play this content');\n                jQuery(this).find('i').addClass('fa-play').removeClass('fa-pause');\n                jQuery(this).find('.screen-reader-only').html('start carousel autoplay');\n                // Stop the slideshow.\n                swiper4383456_1.autoplay.stop();\n              }\n            });\n            // Play button event listener.\n            jQuery(document).on('click keypress', '#listing-wrapper-4383456_1 .swiper-play-button', function(e) {\n              if (e.which == 13 || e.which == 32 || e.type == 'click') {\n                // Switch classes to pause button.\n                jQuery(this).addClass('swiper-pause-button').removeClass('swiper-play-button');\n                jQuery(this).attr('aria-pressed', false);\n                jQuery(this).attr('aria-label', 'Stop Automatic carousel');\n                jQuery(this).find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/pause_icon_dark.svg');\n                jQuery(this).find('img').attr('alt', 'pause this content');\n                jQuery(this).find('i').addClass('fa-pause').removeClass('fa-play');\n                jQuery(this).find('.screen-reader-only').html('pause carousel autoplay');\n                // Start the slideshow.\n                swiper4383456_1.autoplay.start();\n              }\n            });\n\n            // save the previous state of the play/pause button\n            previousPlayPauseButtonState = typeof(previousPlayPauseButtonState) !== \"undefined\" ? previousPlayPauseButtonState : {}\n\n            // Play/pause button event listeners for focus and hover\n            jQuery(document).on('focusin mouseenter', \"#listing-wrapper-4383456_1 .swiper-outer-container\" ,function(e) {\n                previousPlayPauseButtonState[4383456] = swiper4383456_1.autoplay.running\n                var ppButton = jQuery(this).next().find('.swiper-pause-button')\n                // Switch classes to play button.\n                ppButton.attr('aria-pressed', true);\n                ppButton.attr('aria-label', 'Start Automatic  carousel');\n                ppButton.find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/play_icon_dark.svg');\n                ppButton.find('img').find('img').attr('alt', 'play this content');\n                ppButton.find('i').addClass('fa-play').removeClass('fa-pause');\n                ppButton.find('.screen-reader-only').html('start carousel autoplay');\n                ppButton.addClass('inactive').addClass('swiper-play-button').removeClass('swiper-pause-button');\n                // Stop the slideshow.\n                swiper4383456_1.autoplay.stop();\n            })\n            jQuery(document).on('focusout mouseleave', \"#listing-wrapper-4383456_1 .swiper-outer-container\" ,function(e) {\n                var ppButton = jQuery(this).next().find('.swiper-play-button')\n                if (previousPlayPauseButtonState[4383456] === true ) {\n                  // Switch classes to play button.\n                  ppButton.attr('aria-pressed', false);\n                  ppButton.attr('aria-label', 'Stop Automatic  carousel');\n                  ppButton.find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/pause_icon_dark.svg');\n                  ppButton.find('img').find('img').attr('alt', 'pause this content');\n                  ppButton.find('i').addClass('fa-pause').removeClass('fa-play');\n                  ppButton.find('.screen-reader-only').html('pause carousel autoplay');\n                  ppButton.addClass('swiper-pause-button').removeClass('swiper-play-button').removeClass('inactive');\n                  // Stop the slideshow.\n                  swiper4383456_1.autoplay.start();\n                }\n                ppButton.removeClass('inactive')\n            })\n\n                        swipers.push(swiper4383456_1);\n          }\n          // Control jumplinks.\n          jQuery(document).on('click keypress', '#carousel-4383456_1-jumplink-control', function(e) {\n            if (e.which == 13 || e.which == 32 || e.type == 'click') {\n              e.preventDefault();\n              jQuery('#carousel-4383456_1-autoplay-control').focus();\n            }\n          });\n          // Content jumplinks.\n          jQuery(document).on('click keypress', '#carousel-4383456_1-jumplink-control-content', function(e) {\n            if (e.which == 13 || e.which == 32 || e.type == 'click') {\n              e.preventDefault();\n              jQuery('#carousel-4383456_1-jumplink-control').focus();\n            }\n          });              How to   Expand All      Training FAQs      When will be the next session be?  Summer 2024  I’m not an IT professional, can I still sign-up?  Yes, you can. However, we will be rolling out a couple of courses that are appropriate for non-IT professionals. These will be announced in the coming months.  How to do sign-up?  Complete the form here  How is the course structured?  The course can be in-person and remote over five full days with an external trainer. There will be an exam on the last day, which if passed, will give you formal accreditation.  What happens after I complete the course?  Once you have passed the exam, you will receive the CISMP qualification.  Will I receive CIPD points when I complete the course?  Unfortunately you will not receive CIPD points, however, you will receive a professional qualifications from the British Computer Society and a year's free membership.        Getting ready for the CISMP exam       Ahead of time install Zoom and QuestionMark Secure.  Also register on the BCS candidate portal . All those links are sent to you once you schedule your exam.  Arrive 10 mins before exam time and click on the Zoom link that's been emailed to you 24-hours before the exam (it's a one-way Zoom video / 2-way audio call with a screenshare for the duration of the exam).  The invigilator checks your ID - ID held up to camera.  You need to login to the BCS candidate portal while on that screenshare and the invigilator gives you an unlock code which you type into the portal.  This unlocks a start button, which when clicked launches the QuestionMark  Secure browser / the overview page of the exam.  From this point on the invigilator can’t see your screen, but you're on camera and locked out of everything but the secure browser.  You click to start the exam and off you go. There's a countdown of time remaining, top right.  You verbally tell the invigilator when you're done, and then click End Exam.  You get a provisional result immediately on screen.  You will be asked to take a photo of the screen.  The secure session will end.  Zoom call ends.                       Contact us  Cyber Security Competency Centre                Expression of interest   Sign up for our Cyber Security training  Sign up               Related links    Competency Centres  Digital Transformation  InfoSec  SharePoint Resources                   "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Workflow and Automation Competency Centre", "content": "          Do you wish there was an easier way to input data, manage processes, or automatically provide updates to staff or external reporting bodies? Do you want to know more about the uses of tools like Microsoft Power Platform, or the transformative potential of AI?  The Workflow and Automation Competency Centre can help. We will provide a team of friendly business technologists and technical experts to help analyse your needs and provide practical solutions. We can offer free consultation, staff training, and technical support to transform the way that your department, centre or project works. Automating elements of your workflow means freeing up staff time and replacing manual, potentially error-prone processes with simple but powerful software solutions.  We’re not wedded to technological answers. We will work closely with Focus , Oxford’s change and continuous improvement initiative, to identify cases where changes in working practices, and staff skills and empowerment, can complement our technical offer. We can provide a single point of contact for your team, facilitating links with other IT or training providers at the University, to enable your digital transformation.                  Meet the team                    Dave Smith       Enterprise IT Architect, IT Services                    Alwyn Collinson       Head of Competency Centres, Digital Transformation                    Stephen Kavanagh       Business Technologist, IT Services                    Roberta Burtsal       Continuous Improvement Practitioner, Focus                    Atika Hadi       Competency Centres Training Manager, Digital Transformation                    Kate Welsby       Continuous Improvement Practitioner, Focus               if (typeof swipers == 'undefined') {\n            // initialise our swipers array\n            var swipers = [];\n          }\n                      jQuery(document).ready(function() {\n              initializeSwiper4383986_1();\n            });\n                    function initializeSwiper4383986_1() {\n            var swiper4383986_1 = new Swiper('#swiper-container-4383986_1', {\n              preloadImages: true,\n              updateOnImagesReady: true,\n              keyboard: true,\n              a11y: true,\n              observer: true, \n              observeParents: true,\n\n              \n                              loop: false,\n              \n              \n                              pagination: {\n                  el: '#swiper-pagination-4383986_1',\n                  type: 'bullets',\n                  dynamicBullets: true,\n                  dynamicMainBullets: 12,\n                  clickable: true\n                },\n              \n                              slidesPerView: 3,\n                                spaceBetween: 16,\n                                breakpoints: {\n                  1400: {\n                                          spaceBetween: 16,\n                                      },\n                  1200: {\n                                          spaceBetween: 16,\n                                      },\n                  992: {\n                                          slidesPerView: 2,\n                                                              spaceBetween: 16,\n                                        },\n                  768: {\n                                          slidesPerView: 2,\n                      spaceBetween: 16,\n                                      },\n                  320: {\n                    slidesPerView: 1,\n                    spaceBetween: 8\n                  }\n                },\n              \n              \n            });\n            swiper4383986_1.on('paginationUpdate', function(swiper, paginationEl) {\n              let unselectedelements = paginationEl.getElementsByClassName(\"swiper-pagination-bullet-active-main\");\n              for(const el of unselectedelements) {\n                el.setAttribute('aria-pressed', false);\n              }\n              paginationEl.getElementsByClassName(\"swiper-pagination-bullet-active\")[0].setAttribute('aria-pressed', true);\n            });\n            if(swiper4383986_1.pagination) {\n              //have to force an update here to get aria-pressed set correctly.  For some reason the render event isn't emitting\n              swiper4383986_1.pagination.update(swiper4383986_1, swiper4383986_1.pagination.el);\n            }\n            // Pause button event listener.\n            jQuery(document).on('click keypress', '#listing-wrapper-4383986_1 .swiper-pause-button', function(e) {\n              if (e.which == 13 || e.which == 32 || e.type == 'click') {\n                // Switch classes to play button.\n                jQuery(this).addClass('swiper-play-button').removeClass('swiper-pause-button');\n                jQuery(this).attr('aria-pressed', true);\n                jQuery(this).attr('aria-label', 'Start Automatic  carousel');\n                jQuery(this).find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/play_icon_dark.svg');\n                jQuery(this).find('img').attr('alt', 'play this content');\n                jQuery(this).find('i').addClass('fa-play').removeClass('fa-pause');\n                jQuery(this).find('.screen-reader-only').html('start carousel autoplay');\n                // Stop the slideshow.\n                swiper4383986_1.autoplay.stop();\n              }\n            });\n            // Play button event listener.\n            jQuery(document).on('click keypress', '#listing-wrapper-4383986_1 .swiper-play-button', function(e) {\n              if (e.which == 13 || e.which == 32 || e.type == 'click') {\n                // Switch classes to pause button.\n                jQuery(this).addClass('swiper-pause-button').removeClass('swiper-play-button');\n                jQuery(this).attr('aria-pressed', false);\n                jQuery(this).attr('aria-label', 'Stop Automatic carousel');\n                jQuery(this).find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/pause_icon_dark.svg');\n                jQuery(this).find('img').attr('alt', 'pause this content');\n                jQuery(this).find('i').addClass('fa-pause').removeClass('fa-play');\n                jQuery(this).find('.screen-reader-only').html('pause carousel autoplay');\n                // Start the slideshow.\n                swiper4383986_1.autoplay.start();\n              }\n            });\n\n            // save the previous state of the play/pause button\n            previousPlayPauseButtonState = typeof(previousPlayPauseButtonState) !== \"undefined\" ? previousPlayPauseButtonState : {}\n\n            // Play/pause button event listeners for focus and hover\n            jQuery(document).on('focusin mouseenter', \"#listing-wrapper-4383986_1 .swiper-outer-container\" ,function(e) {\n                previousPlayPauseButtonState[4383986] = swiper4383986_1.autoplay.running\n                var ppButton = jQuery(this).next().find('.swiper-pause-button')\n                // Switch classes to play button.\n                ppButton.attr('aria-pressed', true);\n                ppButton.attr('aria-label', 'Start Automatic  carousel');\n                ppButton.find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/play_icon_dark.svg');\n                ppButton.find('img').find('img').attr('alt', 'play this content');\n                ppButton.find('i').addClass('fa-play').removeClass('fa-pause');\n                ppButton.find('.screen-reader-only').html('start carousel autoplay');\n                ppButton.addClass('inactive').addClass('swiper-play-button').removeClass('swiper-pause-button');\n                // Stop the slideshow.\n                swiper4383986_1.autoplay.stop();\n            })\n            jQuery(document).on('focusout mouseleave', \"#listing-wrapper-4383986_1 .swiper-outer-container\" ,function(e) {\n                var ppButton = jQuery(this).next().find('.swiper-play-button')\n                if (previousPlayPauseButtonState[4383986] === true ) {\n                  // Switch classes to play button.\n                  ppButton.attr('aria-pressed', false);\n                  ppButton.attr('aria-label', 'Stop Automatic  carousel');\n                  ppButton.find('img').attr('src', '/sites/all/themes/custom/oxtheme/images/shortcut-icons/pause_icon_dark.svg');\n                  ppButton.find('img').find('img').attr('alt', 'pause this content');\n                  ppButton.find('i').addClass('fa-pause').removeClass('fa-play');\n                  ppButton.find('.screen-reader-only').html('pause carousel autoplay');\n                  ppButton.addClass('swiper-pause-button').removeClass('swiper-play-button').removeClass('inactive');\n                  // Stop the slideshow.\n                  swiper4383986_1.autoplay.start();\n                }\n                ppButton.removeClass('inactive')\n            })\n\n                        swipers.push(swiper4383986_1);\n          }\n          // Control jumplinks.\n          jQuery(document).on('click keypress', '#carousel-4383986_1-jumplink-control', function(e) {\n            if (e.which == 13 || e.which == 32 || e.type == 'click') {\n              e.preventDefault();\n              jQuery('#carousel-4383986_1-autoplay-control').focus();\n            }\n          });\n          // Content jumplinks.\n          jQuery(document).on('click keypress', '#carousel-4383986_1-jumplink-control-content', function(e) {\n            if (e.which == 13 || e.which == 32 || e.type == 'click') {\n              e.preventDefault();\n              jQuery('#carousel-4383986_1-jumplink-control').focus();\n            }\n          });              News   Expand All                     What can the Workflow and Automation Competency Centre do for you?      The new Workflow and Automation Competency Centre is being made available to all staff as a part of Oxford’s Digital Transformation programme. To read more about the Centre, follow this link .             Get in Touch      We now have an Expression of Interest form available for those of you that are interested in workflow and automation for your department, college, faculty or division. Complete the form and one of us will get back to you to arrange an initial discussion.             Workflow Solutions Project Launch      We've launched a project to create a catalogue of workflow solutions in place across the University of Oxford. By identifying and publicising the tools we already use, we can share expertise across the University and learn what's working well for other staff. We'll share and update this catalogue as soon as our first draft is complete, and will use it to identify opportunities for interdisciplinary collaboration and where we might be able to save money and effort by pooling our resources.                                Contact us   workflow.automation-cc@it.ox.ac.uk                Expression of interest   Complete the form               Related links    Competency Centres  Digital Transformation  SharePoint Resources                   "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Oxford’s digital transformation themes", "content": "               We are imagining our digital future together with colleagues and students across collegiate Oxford   People - How can we be digitally confident to innovate individually and together?  Planet - How can we deliver outcomes that are good for the planet as well as people?  Culture - How can we devote ourselves to making Oxford digitally fit for the future?  Process - How can we continuously reimagine the way we work?  Data - How can we trust data to make informed decisions?  Technology - How can we use technology to simplify and make things easier for everyone?                                   Further links    Oxford's digital transformation  Business case for Digital Foundation phase (SSO required)  Building for a digital future - Professor Anne Trefethen's blog                   "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "Building for a digital future", "content": "                 17 October 2022                         As I was writing this blog, the World University Rankings 2023 were published with Oxford at the top – I am sure like me you feel proud to be part of this institution. During our nine centuries of existence, the institution’s ability to evolve with changing times is a constant theme in our success story. Today, we are continuing to grow and adapt in this ever-changing world. In particular, with our Digital Transformation programme, we are reimagining how Oxford University’s culture, processes and technology must evolve in the digital era.  At its last meeting in July, University Council agreed to fund the Foundations for Digital Transformation programme. Many colleagues helped shape the focus of activities for the programme – thank you – and now we’re off the starting block.  It became clear talking with colleagues and students last term that before we attempt an ambitious programme of change, we need to put in place some building blocks and fix some of the issues with existing systems. The Foundations programme aims to do just that. Over the next 18 months you should begin to see improvements: a better integration of some of the systems used for education; expansion of eAssessments in the Exam Schools; and improvements in some of our key administrative systems, including X5 to make sure you don’t get timed out mid-research costing! We’re ironing out the wrinkles in the existing digital services – none of which is terribly exciting but in their own way will transform how we work and hopefully will make life easier.  At the same time, we are putting in place a new type of support hub, called Competency Centres, focused on some key technologies. These will be based in different parts of the University with workflow and automation as the first technology area to be addressed, and cybersecurity as the first capability focus. The business case provides details if you’re interested. This is a bit of an experiment – a new way of growing our capability. I hope it is a success.  This is just the first phase and if we get this right then over the next few years, through working in partnership across the collegiate University, we will be able to introduce appropriately paced and coordinated changes that meet both central and local needs.  Core to this and future phases are the principles for how we deliver digital experiences that are good for the user and for the planet. The Intergovernmental Panel on Climate Change reported estimated values suggesting that consumer devices, data centres and data networks account for anywhere from between 6% and 12% of global electricity use. We need to use this digital transformation to help our sustainability targets, not to get in the way of them. To achieve that we will introduce carbon calculators to help make decisions about new investments in new technology and existing service delivery.  As we deliver this phase of the programme and develop the next, your continuing involvement will be vital to its success. There will be many ways you can continue to share your views and get involved, including an Open Forum on 9 November . Together, we will enable Oxford to preserve its unique place in the world by being digitally fit for the future.                    Share this             Share on facebook Share on twitter Share via email             More news                 The list was updated Announcing the winners of the Vice-Chancellor’s Awards 2024 Announcing the winners of the Vice-Chancellor’s Awards 2024 13 May 2024 Congratulations to the winners, highly commended and finalists of the University-wide celebration of our outstanding people The changing face of research support The changing face of research support 13 May 2024 Stephen Conway, Executive Director of Research Services, outlines the activities across the University to support Oxford’s researchers and their research in an increasingly complex and digital world. Exploring Oxford's GLAM sites Exploring Oxford's GLAM sites 9 May 2024 To celebrate International Museum Day, staff members from some of the GLAM institutions showcase the diverse range of things to see and do across the University's cultural sites                  BACK TO ALL NEWS                  "},
{"university": "University of Oxford", "country": "United Kingdom", "title": "We're all transforming", "content": "                 15 May 2023                         Since my last blog , we have had an energetic nine months for the foundational Phase 1 of Oxford’s Digital Transformation programme .  We started by getting the basics right to fix known problems and improve existing systems. I’m glad to report that progress is being made with several systems, processes and workflows. These improvements are often ‘under the bonnet’ but are helping to simplify life for academics, researchers, professional services staff and students. Happily, X5, our research funding tool , should no longer time out, allowing you to complete your grant application process. And the scaling-up of in-person typed exams at the Examinations Schools is very much underway.  It’s been an exciting time recently as we’ve been gathering inputs from a series of investigative pieces of work, commissioned as part of Phase 1.  During Hilary term, more than 500 colleagues and students from across the collegiate University shared their ideas and insights as part of these investigations. My sincere gratitude to everyone for their contribution – it is fundamental to the success of the Digital Transformation programme.  The investigative projects analysed the potential for areas that were highlighted as a priority but where we were less certain of how to deliver solutions. They’ve explored how we can deliver trusted research environments, make a step change in internal and external communication platforms and improve the student experience through a single hub or app for student services. These investigations have provided ideas for us to ensure Oxford’s digital experience can be more accessible, better designed, secure and better connected.  I’m delighted to report that we’ve introduced three new competency centres – supporting cybersecurity, research cloud computing and workflow and automation. This is a new concept for Oxford, which I hope will help us embed new technologies in the way we work – whether that’s understanding how to automate some administrative systems or how to use AI with research data. The centres will help identify solutions to problems, provide training and most importantly help colleagues understand the tools that are available and how they work. Incidentally, I had the pleasure of meeting the first cohort of colleagues on our new accredited cybersecurity training – read the full story .  At the time of writing this blog, we are also preparing our business case for the next phase of transformation, focusing on staff and students’ digital needs, the transition to Oxford’s new digital governance and delivery model, and the implementation of recommendations from the IT infrastructure service review.  In Michaelmas term 2023, we aim to have the new Governance Framework in place and will begin a pilot of the new delivery model. These changes should, over time, mean that staff and students see services improving continuously and new capability being added as needed.  As you can imagine, this is a fascinating and complex voyage for the University and for all of us. Sometimes, it may feel like we’re not going fast enough, or perhaps that we’re going too fast. I often say digital transformation is not about the digital, it’s about the transformation. It’s about how we adapt the way we work, the processes we put in place, the way we integrate the physical and digital world and developing our skills to be as effective as possible in our design and use of digital services.  Given Oxford’s rich and unique nature, there’s no one-size-fits-all approach to how teams or departments work best. As we move forward, it will be with carefully coordinated experimenting, learning, adjusting, re-learning and transforming. We’ll have opportunities – individually and collectively – to innovate and come up with ideas to fix everyday work conundrums.  Again – thank you to those colleagues and students who have helped us get this far. I look forward to continuing to work with you in the future.                    Share this             Share on facebook Share on twitter Share via email             More news                 The list was updated Announcing the winners of the Vice-Chancellor’s Awards 2024 Announcing the winners of the Vice-Chancellor’s Awards 2024 13 May 2024 Congratulations to the winners, highly commended and finalists of the University-wide celebration of our outstanding people The changing face of research support The changing face of research support 13 May 2024 Stephen Conway, Executive Director of Research Services, outlines the activities across the University to support Oxford’s researchers and their research in an increasingly complex and digital world. Exploring Oxford's GLAM sites Exploring Oxford's GLAM sites 9 May 2024 To celebrate International Museum Day, staff members from some of the GLAM institutions showcase the diverse range of things to see and do across the University's cultural sites                  BACK TO ALL NEWS                  "}
]